[
  {
    "translated_text": "INHALTE (Kurzbeschreibung): Dies ist eine erweiterte Vorlesung in der Zeitreihenanalyse, die auf Grundkenntnissen in Zeitreihen entwickelt wurde.Daher ist eines unserer Master -Module W4451 oder Bachelor -Module W2453 oder ein vergleichbares Modul, das Sie an einer anderen Universität besucht haben, eine notwendige Voraussetzung.Die Hauptthemen dieses Moduls werden in zwei Teile unterteilt: Teil 1: Erweiterte lineare Zeitreihenmodelle, einschließlich der Analyse der Zeitreihen mit Saisonalität und unterschiedlichen Kalendereffekten, multivariaten Zeitreihenmodellen sowie Long Memory Time Series -Modellen.und Teil 2: Fortgeschrittene Themen der nichtlinearen und funktionalen Zeitreihen, einschließlich Volatilitäts- und Dauermodelle mit langer Speicher, multivariate Volatilitäts- und Korrelationsmodelle, Volatilitäts- und Korrelationsmessungen, die auf hohen Frequenz-Finanzdaten sowie der Analyse der funktionalen Zeitreihen mit der Analyse der funktionalen Zeitreihen basierenkurzer oder langer Speicher.Die Fokussierung liegt auf der Einführung der Theorie und der Methoden, der praktischen Implementierung in R und ihrer Anwendung bei der Prognose und Entscheidungsfindung.Die praktische Implementierung in Python wird ebenfalls erörtert, da geeignete Python -Pakete verfügbar sind.Der Antrag auf wirtschaftliche und finanzielle Zeitreihe, insbesondere in nachhaltiger Wirtschaft und Finanzen, wird nachdrücklich betont.Semiparametrische Erweiterungen entsprechender Ansätze unter nicht-stationären Komponenten-Zeitreihenmodellen werden so weit wie möglich beschrieben.Lernergebnisse (Lernergebnisse): Fachkompetenz Wissens (professionelles Fachwissen): Studierende erweiterte Kenntnisse in Zeitreihen und Prognosen;Fortgeschrittene R/Python -Fähigkeiten Fachkompetenz FertKeit (praktische berufliche und akademische Fähigkeiten): Studierende kann erweiterte Rechenwerkzeuge und ausgefeilte moderne statistische Ansätze zur Veranschaulichung und Modellierung verschiedener Arten von Datenagain -Fähigkeiten zur Analyse der großen multivariaten und funktionalen Datensätze nutzen und analysiert weiter KenntnisSprache R und Grundkenntnisse über PythonimProve ihrer Computer-, Datenillustrations- und Datenmanagement -Fähigkeiten, die ihre analytischen und empirischen Studienfähigkeiten Personale kompetenz / sosische (individuelle Kompetenzen / soziale Fähigkeiten): Studierende kooperieren und in Gruppenfähigkeit für die Durchführung eines praktisch relevanten Projektdeep -Verständnisses des Umweltverständnisses arbeitenZeitreihe Personale Kompetenz / SelbstständerDigkeit (individuelle Kompetenzen / Fähigkeit zur autonomen Leistung): Studierende erhalten mehr Fachwissen und Fähigkeiten im wissenschaftlichen Arbeits- und Schreibgain -Fertigkeiten in modernen Datenanalysen und Daten Scieneare Weiter geschult.In unabhängigen und forschungsbezogenen Studieninhalmen (Kurzbeschreibung): Schätzungen Zufolge Sind heutzutage etwa 80% Allerdaten -Ungläubigen.Im Gegensatz Zu Strukturierten DATEN, Die Wohlstukturertert und inhaliert sich meist numerisch Sind, Sind unstrukturierte daten of textuell und daherigeriger Zu interpretieren.Die Aufgabe, Wissen aus textdokumenten Zu extrahieren, Bekannt als textanalyse oder natürliches Sprachverstämis, ist äUzwinder Komplex und Immer Nudg -Begrenzt durche möglichkeiten von computer, die feinhitzer mensen mensen.In denminarer studierenden in der Aktuellen des Maschinellen Lernens und der techniken der Verarbeitung Natürlicher Sprache EINGEFÜHRT (Z.B. Textklassifikation, theenmodellierung, Künnstlich-Neuronale, Worteinbettungen).Durchmeisterprogrammierübungen (Python) Können Die Studiierenden Nick nur IHR Theoretische Wissen über Verschidene Algorithmen VertuchenEs wird geschätzt, dass ungefähr 80%aller vorhandenen Daten unstrukturiert sind.Im Gegensatz zu strukturierten Daten, die in der Regel verwaltet und meist numerisch, sind unstrukturierte Daten häufig textuell und dadurch weitaus schwieriger zu interpretieren.Die Aufgabe, Wissen aus Textdokumenten zu extrahieren, die als Textanalyse oder natürliches Sprachverständnis bezeichnet werden, ist äußerst komplex und immer noch durch die Fähigkeit der Komputer, die Feinheiten menschlicher Sprachen zu verstehen.In diesem Hands-OneSeminar werden die Schüler in den aktuellen Stand der Techniken des maschinellen Lernens und in der Verarbeitung von natürlichen Sprachen (z. B. Textklassifizierung, topicmodelling, künstliche neuronale Netzwerke, Worteinbettungen) eingeführt.Mit ProgrammingExercises (Python) vertiefen die Schüler ihr theoretisches Wissen über Unterschiede und erhalten die Möglichkeit, diese Methoden auf reale Probleme anzuwenden. Lernergebnisse (Learning outcomes): Fachkompetenz Wissen (professional expertise): Studierende kennen die Herausforderungen bei der automatischen Analyse natürlich-sprachiger Textdatenkennen verschiedene Textanalyse-Techniken und können die zugrundeliegende Logik beschreibenkennen die Stärken und Schwächen spezifischer Textanalyse-Techniken​Students ​are aware of the challenges of automatically analysing natural language text dataknow different text analysis techniques and can describe the underlying logicknow the strengths and weaknesses of specific text analysis techniques Fachkompetenz Fertigkeit (practical professional and academic skills): Studierende sammeln Textdaten aus dem Web oder unternehmensinternen Datenquellenbereinigen und transformieren Textdaten, um sie für statistische Analysen nutzbar zu machenwenden Textanalyse-Techniken auf einen vorgegebenen Datensatz an​​​Students collect text data from the web or company data sourcescleanse and transform text data to make it usable for statistical analysesapply text analysis techniques to a given data set​ Personale Kompetenz / Sozial (individual competences / social skills): Studierende ​lösenGeschäftsprobleme (z.B. im Marketing oder Servicemanagement) durch dieErfassung und Analyse von Textdaten (z.B. Online-Rezensionen, Social MediaBeiträge, E-Mails)    ​​Students solve business problems (e.g. in marketing or service management) by collecting and analysing text data (e.g. online reviews, social media posts, emails) Personale Kompetenz / Selbstständigkeit (individual competences / ability to perform autonomously): Studierende wählen die richtige Text-Mining-Technik für ein vorgegebenes (bestimmtes) Problem ausbewerten die Qualität der Text-Mining-Ergebnissesind sich der Grenzen der automatisierten natürlichen Sprachverarbeitung bewusst​Students select the correct text mining technique for a given (specific) problem.evaluate the quality of the text mining resultsare aware of the limitations of automated natural language processing Inhalte (short description): ​Unter dem Begriff Data Science wird im Allgemeinen die Extraktion von Wissen aus großen Datenmengen verstanden. Typischerweise ist das Ziel von Data Science, durch das gewonnene Wissen die Effektivität und Effizienz von Entscheidungsprozessen zu verbessern. In diesem Modul werden grundlegende und fortgeschrittene Konzepte und Methoden der Data Science und Ihre Anwendung in den Wirtschaftswissenschaften behandelt. Der Fokus liegt dabei auf Verfahren des überwachten und unüberwachten maschinellen Lernens (z. B. lineare und logistische Regression, Random Forest, Boosted Decision Trees, Neuronale Netze, Clustering, Dimensionality Reduction). Es handelt sich bei diesem Modul um ein Flipped Classroom Modul (https://de.wikipedia.org/wiki/Umgedrehter_Unterricht), d. h. Studierende erarbeiten die theoretischen Inhalte durch Videos und Lehrbücher unterstützt im Selbststudium. Die Anwendung der erlernten Inhalte geschieht in Präsenzveranstaltungen anhand von praxisnahen Fragestellungen und Fallstudien. Zielgruppe des Moduls sind Studierende der Wirtschaftswissenschaften, die erste praktische Erfahrungen mit dem Thema Data Science machen wollen. Es wird die Bereitschaft zur Einarbeitung in die Programmiersprache R erwartet.The term Data Science generally describes the extraction of knowledge from large amounts of data, its goal to improve the effectiveness and efficiency of decision-making processes through the knowledge thus gained. The course covers basic and advanced concepts and methods of Data Science and their application in an economic context with a focus on supervised and unsupervised machine learning methods (e.g. linear and logistic regression, random forest, boosted decision trees, neural networks, clustering and dimensionality reduction). The course is organized according to the flipped-class-room concept (https://en.wikipedia.org/wiki/Flipped_classroom), i.e. students work out the theoretical contents supported by videos and textbooks in self-study and practising the application in classroom sessions based practical issues and case studies. The course is aimed at students of economics who want to gain first practical experience in the field of data science. Willingness to learn the R programming language is a basic requirement.​ Lernergebnisse (learning outcomes): Fachkompetenz Wissen (professional expertise): Studierende ​kennen die Gemeinsamkeiten und Unterschiede von überwachten und unüberwachten Methoden des maschinellen Lernenskennen grundlegende lineare (insb. lineare und logistische Regression und deren Erweiterungen) und nicht-lineare Modelle (z.B. baumbasierte Verfahren, neuronale Netze) des maschinellen Lernens und können deren Funktionsweise erläuternkennen Methoden und Metriken zur Beurteilung der Qualität von Modellen des maschinellen Lernens​Students ​know common features and differences between supervised and unsupervised machine learning methods.know basic linear (esp. linear and logistic regression and their respective extensions) and non-linear models (e.g. tree-based methods, neural networks) of machine learning and can explain how they workknow methods and metrics for assessing the quality of machine learning models Fachkompetenz Fertigkeit (practical professional and academic skills): Studierende ​wenden verschiedene Verfahren des maschinellen Lernens zur Erklärung und Vorhersage von wirtschaftlichen Phänomenen anevaluieren die Qualität von überwachten und unüberwachten Modellen des maschinellen LernensStudents ​apply various machine learning techniques to explain and predict economic phenomenaevaluate the quality of supervised and unsupervised machine learning models Personale Kompetenz / Sozial (individual competences / social skills): Studierende ​lösen Übungen und Fallstudien gemeinsam in PräsenzveranstaltungenStudents..​​​​solve exercise tasks and case studies together in classroom sessions Personale Kompetenz / Selbstständigkeit (individual competences / ability to perform autonomously): Studierende ​erarbeiten Lerninhalte selbstständig zu Hause mit Hilfe eines Lehrbuchs, begleitenden Videos und Präsentationsfolien​Students independently work out course content at home with the help of a textbook, accompanying videos and presentation slides Inhalte (short description): In the past few years, the popularity of the social media has grown remarkably, with constantly growing up amounts of users sharing all kinds of information through different platforms. More users mean more data to be mined. Therefore, it is vital for marketing organizations to be aware of how people express their opinions and how their feedback can affect their business. This has given rise to Social Media Analytics in order to extract business insight and value from consumer data. Social Media Analysis is a broad concept consisting of Social Network Analysis, Machine learning, Data Mining, Information Retrieval, and Natural Language Processing. Deep learning techniques as a subfield of machine learning enable machines to learn by themselves to classify and cluster the data. The fact that the data contained in social media are highly unstructured named as Big Data, makes deep learning an extremely valuable tool for companies to manipulate the data. These companies use Deep Neural Networks as the foundation stones of deep learning, to decide which concept could be interesting to which customers.To cover the concepts of deep learning in Social Media, this course starts with theoretical explanation of machine learning and data mining. In order to mine the huge number of user-contributed materials (e.g. photographs, videos, and textual context) in social media, different types of Artificial Deep Neural Networks (ADNN) will be explained. Simultaneously, the course covers basics of Python programming language and its data science libraries to equip the students with the tools which are needed to take advantage of the wealth of Big Data.Later, different deep learning algorithms such as Convolutional Neural Networks (CNNs), Recurrent Neural Networks (RNNs), Long Short-Term Memory networks (LSTM), Restricted Boltzmann Machines (RBM), Autoencoders (AE) and Self-organizing Maps (SOM) will be introduced. More specifically the time series analysis, text- and sentiment analysis, image analysis and recommender systems using Deep Neural Networks will be presented. Finally, the topic of Social Recommender Systems (SRS) will be discussed, in which the social relations can be potentially exploited to improve the performance of online recommender systems. To finish the course fruitfully, some mini-projects regarding mining different data derived from social media platforms will be handed to the students.The notes will be declared at the end of the semester Lernergebnisse (learning outcomes): Fachkompetenz Wissen (professional expertise): Studierende … restate the recent technological evolution and related academic works in the field of social media analytics usinG Stand der Technik Deep Learning Algorithmen,… relevante technologiebetriebene Methoden durchführen, um Einblicke aus unstrukturierten Social-Media-Daten zu nutzen.Soziale Netzwerke, um einen tieferen Einblick in Managementprobleme zu erhalten,… erkennen die Bedeutung der Daten von Kunden und Benutzern, um geschäftliche Wert und Erkenntnisse zu schaffen,… Forschung im Bereich der sozialen Medien und kollaborativen Technologien durchzuführen… entwickeln einen analytischen Ansatz, um a zu adressierenForschung oder Managementproblem im Bereich Social Media.Fachkompetenz FertKeit (praktische berufliche und akademische Fähigkeiten): Studierende… Erkennen Sie die Konzepte künstlicher Intelligenz, maschinelles Lernen, Data -Mining und tiefes Lernen in sozialen Medien,… Beschreiben Sie verschiedene Paradigmen des Data Mining wie beaufsichtigtes und unbeaufsichtigtes Lernen,… differenzieren verschiedene Arten von verschiedenen Arten,… unterschiedliche Arten unterscheidenDaten im Bereich der sozialen Medien und der relativen Algorithmen zur Analyse,… Erklären Sie die Theorie künstlicher neuronaler Netzwerke und dessen Schulungsverfahren,… Unterscheidung verschiedener tiefer Lernalgorithmen in sozialen Mediendaten (z.Neuronale Netzwerke für die Textanalyse,…)… nutzen Social -Media -Daten und analysieren sie mit tiefen Lernalgorithmen, um Einblicke für bestimmte Geschäftsprobleme zu erhalten, das Ergebnis der Datenanalyse zu interpretieren,… Anwenden verschiedener Deep -Lern -Algorithmen in Social -Media -Daten in der Python -Umgebung mit Daten anwendenBergbaubibliotheken wie Numpy, Pandas, Matplotlib, Tensorflow, Scikit-Learn und Data V.ISualization -Tools,… Experiment -Daten aus den beliebtesten Social -Media -Plattformen, einschließlich Twitter, Facebook, Google+, Stackoverflow, Blogger, YouTube und mehr, analysieren aktuelle Forschungsbeiträge im Kontext des Deep -Lernens in sozialen Medien.Personale Kompetenz / Sozial (individuelle Kompetenzen / soziale Fähigkeiten): Studierende… Formulierende Managementprobleme in einem sozialen geschäftlichen Kontext formulieren und sie in einem systematischen Ansatz ansprechen, der auf Standardmethoden wissenschaftlicher Daten und Inhaltsanalyse basiert, um praktische Auswirkungen zu leiten,… entwickeln kooperative Fähigkeiten entwickelnIn der gruppenbasierten Aufgabenanalyse, Berichtserstellung, Dokumentation und Präsentation, beobachten Sie einen kritischen Ausblick über gemeinsame Daten in den sozialen Medien.Personale kompetenz / selbstständerDigkeit (individuelle Kompetenzen / Fähigkeit zur autonomen Leistung): Studierende… entwickeln Sie eine kritische und informierte Perspektive auf die Vorteile verschiedener tiefen Analysealgorithmen und deren Merkmale,… Unterscheiden Sie geeignete Deep -Lern -Algorithmen, um ein bestimmtes Geschäftsproblem zu lösen.Interpretieren und bewerten Sie die Qualität und die Auswirkungen der Forschungsergebnisse für Praktiker und Akademiker… Führen Sie eine systematische akademische Forschung zu einem vordefinierten Thema durch, das mit theoretischen Hintergrund und praktischen Anwendungen ermöglicht werden kann.Inhalle (Kurzbeschreibung): Dieser Kurs führt die Schüler in grundlegende Konzepte im Zusammenhang mit elektronischem Austausch und Informationen im Zusammenhang mit diesen Börsen ein.Diese Informationen umfassen Transaktionsdaten (wie Bestellungen und Geschäfte) und Nachrichten.Der Kurs behandelt auch die Analyse der Auswirkungen von Nachrichten auf einen Markt mit Schwerpunkt auf den Finanzmärkten.Zusätzlich zur Methodik, die zur Analyse solcher Daten erforderlich ist, werden die Schüler auch verschiedene Softwaretools vorgestellt, die eine solche Analyse unterstützen. Der Kurs wird von unserem Gastdozenten Prof. Fethi Rabhi (UNSW, Sydey, Australien) angeboten.Lernergebnisse (Lernergebnisse): Fachkompetenz Wissens (Fachkenntnis): Studierende Lernbegriffe zur Beschreibung und Analyse von Finanzbörsen.Fachkompetenz FertKeit (Praktische berufliche und akademische Fähigkeiten): Studierende kann Finanzmarktdaten und Nachrichten analysieren.Personale kompetenz / sosische (individuelle Kompetenzen / soziale Fähigkeiten): Studierende Arbeit in Gruppen und diskutieren die Implikationen von Thelared -Inhalten.Personale Kompetenz / SelbstständerDigkeit (individuelle Kompetenzen / Fähigkeit zur autonomen Leistung): Studierende kann Datenanalysetechniken auf verschiedene Märkte anwenden. Kann die Auswirkungen von Nachrichten auf die Marktpreise bewerten.Inhalle (Kurzbeschreibung): Dieses Modul liefert den Studenten Fundamentalknowledge über quantitative Methoden in der empirischen wirtschaftlichen Forschung atinroduktorisch und angetrieben.Der Fokus liegt auf der Theorie, Schätzung und Anwendung einfacher und mehrerer linearer Regressionsmodelle.Nach einer systematischen Einführung in die Ökonometrie werden ausgewählte spezielle Themen wie Multicollinity, Heteroskedastizität, Modellauswahl und Modelle mit Timeries -Fehlern im Detail behandelt.Eine kurze Einführung in die Analyse der Paneldaten wird so weit wie möglich bereitgestellt.Der Kurs, den IsComputer unterstützt und viele echte Datenbeispiele erhalten. Numerische Beispiele in den Vorträgen und Tutorials werden mit der öffentlichen Programmiersprache R behandelt. Während des Besuchs dieses Modulund Ökonometrie.Lernergebnisse (Lernergebnisse): Fachkompetenz Wissens (Fachkenntnis): Studierende erfasst systematisches Wissen über die Theorie und Anwendung der linearen Regression;Grundlegende Kenntnisse über besondere Probleme und Methoden zur Lösung.Kenntnis der mathematischen Modellierung;Programmierfähigkeiten;Teamfähigkeit.Fachkompetenz FertKeit (Praktische berufliche und akademische Fähigkeiten): Studierende bekannte ökonometrische Modelle;Modellauswahl;Simulationstechnik in der Ökonometrie;Kenntnis der statistischen Programmierung.Personale Kompetenz / Sosial (individuelle Kompetenzen / soziale Fähigkeiten): Studierende Personale Kompetenz / Selbststangeit (individuelle Kompetenzen / Fähigkeit zur autonomischen Leistung): Studierende Ausbildung in Modellierung, Präsentation von Besitzern, Internetsuche, Ausbildung von Selbstlernung, Kooperation und Teamarbeitsfähigkeiten, Teamarbeit, Teamarbeit, Teamarbeit, Arbeitskenntnisse, Teamarbeit, Arbeitskenntnisse, Teamarbeit, Arbeitskenntnisse, Teamarbeit, Arbeitskenntnisse, Teams Fähigkeiten, Teams Fähigkeiten, Teams Fähigkeiten, Teams Fähigkeiten, Teams Fähigkeiten, Teams Fähigkeiten, Teams, Teams Fähigkeiten, Teams Fähigkeiten, Teams Fähigkeiten, Arbeitskräfte, Arbeitskräfte, Arbeitskräfte, Arbeitskräfte, Teamarbeit, Arbeitskräfte, Teams Fähigkeiten, Teams Fähigkeiten, Teams, Teams Fähigkeiten, Teams, Teams für Teams, Teams, die Arbeitskräfte, die Arbeitsfähigkeiten, die Fähigkeiten, die Fähigkeiten zu erstellen, die Fähigkeiten der BesitzerVerbesserte Computerfähigkeiten, Grundlagenforschung.Inhalle (Kurzbeschreibung): In der nieerer Vernetzten Welt in Bisher Ungekannter Art und Weise DATENIERT UND GESAMMELT.Data Science (Film) Bezeichnet Die Extraktion von WISSEN Aus Diesen DATEN.DAS Modul Vermittelteltelt -grunddlegende Konzepte und methodieren entlang des lebenszyklus data Science Projectes, von der Formulierung der Problemstellung über., Klassifikation, Clustering).Das Erlernte methodenwissen wird konontinuierlich durch praxisnahe übungen mit der Programmiersprache r angewandt und vertieft.DAS Modul Umfasst Ein Vorlesung Sowie Eine Übung.LernergeBnisse (Lernergebnisse): Fachkompetenz Wissens (Professionelle Expertise): Studienende studierende …… Kennen typische datenqualitätproblemDeren Funktionssweise Erlärmern Fachkompetenz Fertligkeit (praktische professionelle und akademische Fähigkeiten): Studierende… Bereiten Rohdaten Zur Anschliebene Visualisierung und Statistischen Analyse analyse auf… visusisens quantitativ datteneSosische (individuelle Kompetenzen / soziale Fähigkeiten): Studierende… Lösen BiebswirtsbüroLicheProblemStellungen Durchwendung von Data Science Methodden Personale Komketenz / SelbstständerDigKeit (individuelle Kompetenzen / Fähigkeit zur Autonom durchzuführenOUSLY): Studierende… evaluieren Die Qualität von Rohdaten… Wämlen Die Passenden Methoden zum Visualisierung und Statistische analysieren Gegebener datensätze aus… Bewerten Die Qualität von Modellen Descinellen Masziale MEDICEL MEDIZE MEDIZE MEDIZE MEDIZE MEDIZE MEDIZE (Kurzfilm Beschreibung): Die Vernetaler -Medien -Medien (Kurzweite Beschreibung).Hinterläst der Nie Zuvor Gekannte Menge Digitaler DATEN.Diese werden zunehmend durch unternehmen asserDie Forschung und Auch Zahlhreiche unternehmen entwickeln diverse Analytische Ansitze, ähm aus Massenrohaden sinnvolle und Wirbelriche relevantes Einillens Zu Erzeugen.Social -Media -Manager BEISPIELSWEISE VERWINGEN AGGGRETE DARSTELLUNGEN DATEN IN Dashboards, Um den Erfolg Ihrer Arange (Z.B. Verb. Verbessernde KundenwahrnehMung, Vertrieb) ZU Messen.Forscher identifizieren generelle musere und entwickeln metriken und theorien.um sich Dieem Zentrieren Arteils- und Forschungskontext Zu Nähzentrieren und Die Metriken und Einsichten zu Social-Busine, Wird in DieemmoduL Zunautanst Daser, Daserzen.ss als ein relevanter organisatorischer Kontext vorgestellt. Eine wichtige Rolle hierbei spielen die Managementwerkzeuge von Social Media Managern, welche die firmenrelevanten digitalen Aktivitätsdaten der Onlinenutzer in den sozialen Medien aufbereiten, verdichten und visualisieren. Parallel verwenden die Manager direkte Antworten und Reaktionen ihrer Kundengruppe als qualitative Daten für ihre Analysen. Auf Basis dieser Managementperspektive werden im Modul dann verschiedene Ansätze von Social Media Analytics besprochen und angewendet. Beispiele sind die Erstellung von Personas, Genreanalysen, Community Health Analysen, Time-Series Analysen, Event-Impact Analysen oder Netzwerkanalysen. Parallel zur Untersuchung einiger praktischer Fallbeispiele entwickeln die Teilnehmer ein eigenes Analyseprojekt auf Basis der besprochenen Methoden. Ziele sind hierbei, die komplexen digitalen Phänomene besser zu verstehen, unternehmensrelevante Einsichten für Social Media Manager zu generieren sowie eventuell darüberhinausgehend einen Forschungsbeitrag zu entwickeln (z.B. neue Metriken, Visualisierung oder Aufdeckung genereller Phänomene, Designs). Der zu erstellende Projektbericht basiert auf der Struktur und den Methoden wissenschaftlicher Artikel und ermöglicht dadurch den Teilnehmern, anschließende akademische Arbeiten (z.B. Masterarbeit, eigene Publikationen) auf den Ergebnissen des Moduls aufzubauen. Lernergebnisse (learning outcomes): Fachkompetenz Wissen (professional expertise): Studierende ​… lernen neue wissenschaftliche Erkenntnisse und Artikel im Themenkomplex Social Media / Kooperative Technologien kennen… lernen Ansätze der Datensammlung im Vorfeld der Social Media Forschung… kennen Verfahren zur wissenschaftlichen Datenanalyse und InterpretationStudents learn about… current scientific insights and articles in the social media and collaborative technologies field,…approaches of social media data collection and transformation as a base for social media research,…approaches of scientific data analysis and interpretation. Fachkompetenz Fertigkeit (practical professional and academic skills): Studierende ​… analysieren aktuelle Forschungsbeiträge im Kontext von Social Media und kooperativen Technologien,… konzipieren einen eigenen Forschungszugang zum Thema,… erfassen und generieren ein Datenset als Ausgangspunkt wissenschaftlicher Analysen,… wenden Werkzeuge zur Datenanalyse und Interpretation an,… entwickeln einen systematischen Ansatz zum Aufbau und zur Strukturierung eines eigenen akademischen Forschungsprojekts (z.B. als Vorstufe zur Masterarbeit).Students……analyse current research in the field of social media and collaborative technologies,…generate their own transformed social media dataset to fit for research inquiries,…develop a systematic analytical approach to address a research or management problem (e.g., as a precursor for a master thesis). Personale Kompetenz / Sozial (individual competences / social skills): Studierende ​… können ungeklärte Fragestellungen aus Forscherperspektive zielorientiert und abstrakt formulieren und mit systematischen Standardmethoden der Daten bzw. Inhaltsanalyse kritisch untersuchen, sowie praktische Implikationen ableiten.Students……are enabled to formulate management-oriented problems in a social business context and address them in a systematic approach based on standard methods of scientific data and content analysis to derive practical implications. Personale Kompetenz / Selbstständigkeit (individual competences / ability to perform autonomously): Studierende ​… entwickeln eine kritische Perspektive auf neueste technische Entwicklungen,… wählen die passenden Methoden zur Analyse gegebener Fragestellungen aus,… bewerten die Qualität und Generalisierbarkeit der Ergebnisse und ihrer Implikationen für die Forschung und Praxis.Students…… develop a critical and informed perspective on the benefits of different software-based analytical methods and tools,… can choose in an informed manner appropriate tools and methods to best address a given business problem,… can evaluate the quality and the implications of the research results for practitioners and academics Inhalte (short description): ​This module introduces the students to Data Science and one ofthe main sub-area of Data Science, e.g. Statistical Learning, as well as theprogramming languages R and Python. Covered topics of this course are e.g. abrief introduction to Data Science, an Introduction to StatisticalLearning,  LinearRegression, Klassifizierung, Kreuzvalidations- und Resampling-Methoden, Modellauswahl unter Verwendung von Stepwiseregression und Regularisierung unter Verwendung von Ridge-Regression und Lasso, Regressionsplinen, nicht parametrische Regression, Bäume basierende Entscheidung, Baggin, Boosting, zufällige Forest, Unterstützung von Vektormaschinen und ungeachtet).Der Teile ist in drei Teile aufgebaut: Teil 1 - Eine Einführung in DataBience und statistisches Lernen sowie einen Überblick über den Zweck, die Theorganisation, die Hauptthemen sowie die Bewertung dieses Moduls.Teil 2 - Einführung in das statistische Lernen von Grundlagen.Hauptinhalte dieses Teils sind grundlegende und fortschrittliche konzeptähnliche einfache lineare Regression, multiple lineare Regression, Polynomialregression, logistische Regression, lineare Diskriminanzanalyse, quadratische Diskriminanzanalyse, K-nearste Nachbarn, Kreuzvalidierung, Bootstrap und stellvertretende Regression.Teil 3 - Einführung in AdvancedFundamentals des statistischen Lernens.In diesem Teil liegt der Fokus auf anspruchsvolleren Konzeptionen wie Ridge Regression, Lasso, Hauptkomponentenregression, Partiallastquadrate, Regressions -Kleien, verallgemeinerte Additivmodelle (GAMS), Regressionstrees, Klassifizierungsbäume, Absaging, zufällige Wälder, Boosting, maximale Marginklassifierer, Support -Vektorklassifizierungenund unterstützen Vektormaschinen.Weitere possible Themen des unbeaufsichtigten Lernens sind z.Hauptkomponentenanalyse, K-Means-Clusteranalyse und hierarchische Clusteranalyse. Beachten Sie, dass die Themen der Seminarprojekte auf der Anwendung statistischer Lernansätze für finanzielle und wirtschaftliche Daten vorliegen sollten.Lernergebnisse (Lernergebnisse): Fachkompetenz Wissens (Fachkenntnisse): Studierende Verständnis des modernen Datenwissenschaftsfundamentalkenntnisses über Datenwissenschaft, verwandte Probleme und Methoden zur Lösung dieser.Verständnis der Beziehung zwischen Statistik, Ökonometrie und Datenwissenschaft. Verstehen Sie die Wirtschaftsrolle in der Datenwissenschaft und umgekehrt.Weitere fortgeschrittene Konzepte von beaufsichtigten statistischen und maschinellen Lernen.Fachkompetenz FertKeit (Praktische berufliche und akademische Fähigkeiten): Studierende Die Fähigkeit, grundlegende und ausgefeilte statistische Lernkonzepte zu verwenden.Erwerben Sie Fähigkeiten, um große und komplexe Datensätze zu sammeln, zu verwalten, visualisieren und analysieren. Geben Sie fortgeschrittenes Wissen über die Programmiersprache.Problemdefinition und Problemlösung Gewinne Fähigkeit zur Verwaltung und Implementierung eines kleinen empirischen Studienprojektimprove-Kooperations- und Team-Arbeitskräfte.Personale Kompetenz / SelbstständerDigkeit (individuelle Kompetenzen / Fähigkeit zur autonomen Leistung): Studierende Gewinnfähigkeit von selbstlerniger Mehr Fachwissen in wissenschaftlicher Arbeit.Verbesserung der Fertigkeiten der Computerdatenanalyse.Inhalle (Kurzbeschreibung): Dies ist ein fortgeschrittenes Seminar in der Datenwissenschaft, das insbesondere die Bereiche moderner statistischer und ökonometrischer Ansätze sowie statistisches und maschinelles Lernen abdeckt.Grundlegende Themen sind auf der Anwendung geeigneter Algorithmen in diesen Bereichen zur Modellierung wirtschaftlicher und finanzieller Daten, insbesondere für die wirtschaftliche und finanzielle Zeitreihe, basierend auf bekannten Forschungsergebnissen in der Literatur.Zu diesem Zweck sollten neue Instrumente in modernen Bereichen der Statistik und Ökonometrie wie lokale Polynomregression, P-Splinen, quantile Regression und funktionelle Datenanalyse berücksichtigt werden.Weitere neue Werkzeuge in wiederkehrenden neuronalen Netzwerken, tiefes Lernen und Verstärkungslernen sollten eingesetzt werden.Modellierung und Prognose multivariater Zeitreihen unter Verwendung der richtigen Anpassungen der oben genannten Ansätze werden ebenfalls untersucht.Für hochrangige oder forschungsorientierte Seminarwerke arbeitet fortgeschrittenere Themen, z.Die Erweiterung der derzeit verwendeten Methoden in der Literatur zur semiparametrischen Modellierung von Long Memory Time Series, Deep-Lernen von multivariaten, funktionalen oder hochfrequenten finanziellen und wirtschaftlichen ZeitserieS sowie maschinelles Lernen Algorithmen für große finanzielle und wirtschaftliche Daten können angeboten werden.LernergeBnisse (Lernergebnisse): Fachkompetenz Wissens (Fachkenntnisse): Studierende Fachkompetenz Fertelleit (praktische berufliche und akademische Fähigkeiten): Studierende die Fähigkeit, grundlegende und ausgefeilte statistische Lernkonzepte zu verwenden.Erwerben Sie Fähigkeiten, um große und komplexe Datensätze zu sammeln, zu verwalten, visualisieren und analysieren. Geben Sie fortgeschrittenes Wissen über die Programmiersprache.Problemdefinition und Problemlösungsfähigkeit Fähigkeit zur Verwaltung und Implementierung einer kleinen empirischen Studienprojektimprove Genossenschaft und Team-Arbeit.Personale kompetenz / selbststängigkeit (individuelle Kompetenzen / Fähigkeit zur autonomen Leistung): Studierende Gewinnfähigkeit von selbstlernigerer mehr Fachwissen in der wissenschaftlichen Arbeit, Inhalte: Inhalte der Lehrveranstaltung Master-Abschlussarbeit – Arbeitsplan: Nach Themenabsprache mit dem Betreuer erfolgt eine erste grobe Einarbeitung. Auf dieser Grundlage und einer ersten Literaturrecherche ist durch den Studierenden ein Arbeitsplan vor- zulegen, der die zu erzielenden Ergebnisse samt Meilensteine für die Arbeit dokumentiert. Inhalte der Lehrveranstaltung Master-Abschlussarbeit: In der Masterarbeit zeigt der/die Kandidat/in seine/ihre Fähigkeit zum selbständigen wissenschaft- lichen Arbeiten an einem angemessen anspruchsvollen Thema, das auch Gelegenheit zur Entfal- tung eigener Ideen gibt. Auf der Grundlage des “State-of-the-art” sollen die Methoden der Infor- matik systematisch angewendet werden. Die Ergebnisse der Arbeit werden in einem fakultätsöf- fentlichen Vortrag vorgestellt. Konkrete Aufgabenstellungen für Masterarbeiten werden laufend auf den Webseiten der Fachge- biete des Instituts für Informatik veröffentlicht. 42   5 Lernergebnisse und Kompetenzen: Mit Abschluss der Masterarbeit haben die Studierenden gezeigt, dass sie  ein Problem innerhalb einer bestimmten Frist ein Problem nach wissenschaftlichen Metho- den bearbeiten können,  die im Zuge des Studiums erworbenen fachlich-methodischen fachübergreifenden Kompe- tenzen zur Lösung komplexer Aufgabenstellungen anwenden können. Die Schwerpunkte variieren ja nach Aufgabenstellung. Nichtkognitive Kompetenzen:  Einsatz und Engagement  Lernkompetenz  Lernmotivation  Motivationale und volitionale Fähigkeiten  Schreib- und Lesekompetenz (wissenschaftlich)  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Projektgruppe: In einer Projektgruppe bearbeitet eine Gruppe von in der Regel 8-16 Studierenden über den Zeitraum eines Jahres (zwei Semester) ein vom Veranstalter vorgegebenes Thema. Inhaltlich sollen Projektgruppen die Studierenden an aktuelle Forschungsthemen heranführen und durch die Teamarbeit auf die Arbeitsweise der industriellen Praxis vorbereiten. Themen von Projektgruppen decken das gesamte Spektrum der Forschungsgebiete der Fachge- biete des Instituts für Informatik ab. 5 Lernergebnisse und Kompetenzen: In der Projektgruppe wird Teamarbeit und Organisation eines Projekts praktisch erprobt und er- lernt; hierdurch werden die Teilnehmer auf die spätere industrielle Berufspraxis vorbereitet. Die Studierenden lernen umfangreiche Entwicklungsprozesse im Team aus eigener Anschauung ken- nen. Durch die ausdrückliche Arbeitsteilung entsteht der Zwang, über eigene Arbeiten innerhalb der Gruppe zu berichten und die Ergebnisse zu vertreten. Nichtkognitive Kompetenzen  Einsatz und Engagement  Gruppenarbeit  Lernkompetenz  Lernmotivation  Motivationale und volitionale Fähigkeiten  Schreib- und Lesekompetenz (wissenschaftlich)  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Seminar: In Seminaren erarbeiten sich die Teilnehmer ein Thema, welches in einem Vortrag mit anschlie- ßender Diskussion und einer schriftlichen Ausarbeitung präsentiert wird. Vortragsmaterial und Ausarbeitung dienen dabei unterschiedlichen Zielen: Während das Vortragsmaterial zur Unter- stützung des Vortrags dient (der in engen zeitlichen Grenzen abläuft), dient die Ausarbeitung dazu, sich zu einem späteren Zeitpunkt detailliert über das Thema informieren zu können. Ein Seminar beschäftigt sich in der Regel mit 8 bis 15 zusammenhängenden Teilthemen, die von je einem Teilnehmer bearbeitet werden. Die Seminarthemen decken das gesamte Spektrum der Forschungsgebete der Fachgebiete des Instituts für Informatik ab. 5 Lernergebnisse und Kompetenzen: Im Seminar sollen die Studierenden Techniken zur selbständigen Erarbeitung von nichttrivialem Stoff erlernen, indem sie sich in ein forschungsnahes Teilgebiet der Informatik einarbeiten. Sie sollen lernen, einen Vortrag zu planen, der sich an zeitliche Vorgaben (üblicherweise 45 bis 60 Mi- nuten) hält, und dabei inhaltliche Prioritäten zu setzen. Die Teilnehmer sollen praktisch erfahren, wie man als Zuschauer aus einem Vortrag Kenntnisse aufnimmt, und in Diskussionen Meinungen und Information austauschen. Seminare dienen auch der Vermittlung rhetorischer Fähigkeiten bei Vortrag und Diskussion. Die Teilnehmer sollen lernen, den Vortrag entlang einer inhaltlichen Linie zu strukturieren und verschiedene Mittel zur Illustration komplexer Sachverhalte zu nutzen. Ebenso soll der angemessene Umgang mit Literatur gelernt werden. Nichtkognitive Kompetenzen  Einsatz und Engagement  Kooperationskompetenz  Lernkompetenz  Medienkompetenz  Motivationale und volitionale Fähigkeiten  Schreib- und Lesekompetenz (wissenschaftlich)  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Seminar: In Seminaren erarbeiten sich die Teilnehmer ein Thema, welches in einem Vortrag mit anschlie- ßender Diskussion und einer schriftlichen Ausarbeitung präsentiert wird. Vortragsmaterial und Ausarbeitung dienen dabei unterschiedlichen Zielen: Während das Vortragsmaterial zur Unter- stützung des Vortrags dient (der in engen zeitlichen Grenzen abläuft), dient die Ausarbeitung dazu, sich zu einem späteren Zeitpunkt detailliert über das Thema informieren zu können. Ein Seminar beschäftigt sich in der Regel mit 8 bis 15 zusammenhängenden Teilthemen, die von je einem Teilnehmer bearbeitet werden. Die Seminarthemen decken das gesamte Spektrum der Forschungsgebete der Fachgebiete des Instituts für Informatik ab. 5 Lernergebnisse und Kompetenzen: Im Seminar sollen die Studierenden Techniken zur selbständigen Erarbeitung von nichttrivialem Stoff erlernen, indem sie sich in ein forschungsnahes Teilgebiet der Informatik einarbeiten. Sie sollen lernen, einen Vortrag zu planen, der sich an zeitliche Vorgaben (üblicherweise 45 bis 60 Mi- nuten) hält, und dabei inhaltliche Prioritäten zu setzen. Die Teilnehmer sollen praktisch erfahren, wie man als Zuschauer aus einem Vortrag Kenntnisse aufnimmt, und in Diskussionen Meinungen und Information austauschen. Seminare dienen auch der Vermittlung rhetorischer Fähigkeiten bei Vortrag und Diskussion. Die Teilnehmer sollen lernen, den Vortrag entlang einer inhaltlichen Linie zu strukturieren und verschiedene Mittel zur Illustration komplexer Sachverhalte zu nutzen. Ebenso soll der angemessene Umgang mit Literatur gelernt werden. Nichtkognitive Kompetenzen  Einsatz und Engagement  Kooperationskompetenz  Lernkompetenz  Medienkompetenz  Motivationale und volitionale Fähigkeiten  Schreib- und Lesekompetenz (wissenschaftlich)  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Studium Generale – Master: Abhängig von den gewählten Veranstaltungen. 122   5 Lernergebnisse und Kompetenzen: Die Studierenden erweitern ihren wissenschaftlichen Horizont über die Grenzen der Informatik und des gewählten Nebenfaches hinaus. Je nach gewählter Veranstaltung haben sie Kompeten- zen im Bereich Kommunikationsfähigkeit, Teamarbeit und Präsentationstechniken erworben. Nichtkognitive Kompetenzen  Einsatz und Engagement  Kooperationskompetenz  Medienkompetenz  Schreib- und Lesekompetenz (wissenschaftlich)  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Advanced Algorithms: Dieser Kurs präsentiert fortgeschrittenen Algorithmen und algorithmische Paradigmen für grund- legenden Probleme. Insbesondere werden dabei Methoden wie Randomisierung und Derandomi- sierung, sowie die Konzepte von Approximations- und Onlinealgorithmen anhand wichtiger algo- rithmischer Probleme vorgstellt. In allen Fällen werden Korrektheitsbeweise und Laufzeitanalysen durchgeführt.  Randomisierte Algorithmen, Derandomisierung, Beispiele u.a. Randomized Rounding  Online Algorithmen, Beispiele u.a. ais dem Bereich Scheduling  Approximationsalgorithmen, Beispiele u.a. NP-schwere Probleme 143   5 Lernergebnisse und Kompetenzen: Die Studierenden wenden fortgeschrittene algorithmische Entwurfsmethoden wie Randomisie- rung, Approximation und Onlinealgorithmen auf neue Probleme an und analysieren sie unter Nut- zung von kombinatorischen und wahrscheinlichkeitstheoretischen Methoden. Nichtkognitive Kompetenzen  Lernkompetenz  Lernmotivation 6  ,  Inhalte: Inhalte der Lehrveranstaltung Advanced Complexity Theory: Komplexitätstheorie beschäftigt sich mit der Bestimmung der Größe von Ressourcen (z.B. Lauf- zeit, Speicherverbrauch), die notwendig und hinreichend ist für die Lösung eines bestimmten algorithmischen Problems (z.B. Problem des Handlungsreisenden (TSP)) auf einem bestimmten Computermodell (z.B. Turing-Maschine). Ein Ansatz ist die Komplexitätsklassen wie z.B. P , NP , PSPACE zu deﬁnieren, um die Problemkomplexität mit Hilfe der Vollständigkeit in einer solchen Klasse zu klassiﬁzieren, wie z.B. die berühmte Klasse der NP-vollständigen Probleme. Dies er- gibt bedingte Aussagen wie “Wenn NP nicht gleich P , dann ist TSP nicht in Polynomialzeit lösbar”. Dieser Zweig der Komplexitätstheorie wird oft als strukturelle Komplexitätstheorie bezeichnet. Im Gegensatz dazu ist das Beweisen expliziter Untergrenzen für bestimmte Probleme das Thema der so genannten konkreten Komplexitätstheorie. Da niemand derzeit in der Lage ist superlineare Zeitschranken für explizit deﬁnierte Probleme in allgemeinen Rechenmodellen wie Turingmaschi- nen zu beweisen, betrachtet man etwas eingeschränkt Modelle wie 1-Band Turingmaschinen, monotone Bool’sche Schaltkreise, Bool’sche Schaltkreise mit beschränkter Tiefe, algebraische Berechnungsmodelle und verschiedene Arten von parallelen Berechnungsmodellen. Die Vorle- sung gibt eine Übersicht von Ansätzen um solche unteren Schranke in verschiedenen Modellen zu beweisen.  Deterministische, nichtdeterministische und probabilistische Zeit- und Platz- Komplexitätsklassen, Hierarchien, Vollständigkeit  Untere Schranken für Größe und Tiefe verschiedener Varianten von von Booleschen Schalt- kreisen  Untere Schranken für Algebraische Berechnungen 5 Lernergebnisse und Kompetenzen: Die Studierenden beherrschen die wichtigsten Techniken im Bereich der Komplexitätstheorie wie Reduktionen, Diagonalisierung, Randomisierung und Relativierung. Sie können entscheiden, in welche Komplexitätsklassen sich der Speicherplatzbedarf und die Laufzeitanforderungen von al- gorithmischen Problemen einordnen lassen. Sie können mit Hilfe der Konzepte der Komplexitäts- theorie Hypothesen aufstellen und diese falsiﬁzieren oder veriﬁzieren. Sie können die Zusam- menhänge zwischen Komplexitätsklassen wie P und NL erläutern. Nichtkognitive Kompetenzen  Haltung und Einstellung  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Advanced Computer Architecture: Die Lehrveranstaltung vermittelt die wesentliche Konzepte und Methoden, die beim Entwurf mo- derner Prozessoren Verwendung ﬁnden. Es werden Ansätze zur Nutzung von Parallelität auf der Instruktions-, Daten- und Thread-Ebene besprochen.  Grundlagen der Rechnerarchitektur (Wiederholung und Zusammenfassung)  Entwurf der Speicherhierarchie  Parallelität auf Instruktionsebene  Datenparallelität: Vektor-, SIMD- und GPU-Architekturen  Parallelität auf Thread-Ebene  Warehouse-scale Computer 5 Lernergebnisse und Kompetenzen: Die Studierenden sind nach dem Besuch der Lehrveranstaltung in der Lage,  die Prinzipien modernen Speicherhierarchien zu erklären,  die verschiedenen Ebenen der Parallelitaet zu analysieren,  die Eignung unterschiedlicher Architekturkonzepte einzuschätzen und dadurch  moderne Entwicklungen der Rechnerarchitektur zu bewerten. Nichtkognitive Kompetenzen  Gruppenarbeit  Lernkompetenz 193   6  ,  Inhalte: Inhalte der Lehrveranstaltung Advanced Distributed Algorithms and Data Structures: Die Vorlesung stellt fortgeschrittene Methoden für verteilte Algorithmen und Datenstrukturen vor. Themen sind unter anderem Zugriffskontrolle, Synchronisation, Konsensus, Informationsverbrei- tung, hybride Netze, Scheduling, und Optimierung. Aufbauend auf Lösungen zu diesen Themen werden auch konkrete Anwendungen vorgestellt. 5 Lernergebnisse und Kompetenzen: Studierende lernen fortgeschrittene Methoden und Verfahren für aktuell sehr relevante verteilte Systeme kennen. Sie können Verfahren an neue Situationen anpassen und deren Komplexität bestimmen. Sie können grundlegende Verfahren implementieren. Nichtkognitive Kompetenzen  Gruppenarbeit  Lernkompetenz  Schreib- und Lesekompetenz (wissenschaftlich)  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Algorithms for Highly Complex Virtual Scenes: Walkthrough-Systeme erlauben das Betrachten und Durchlaufen von virtuellen 3D-Szenen und ﬁnden Anwendung in Architekturprogrammen, Simulationen, oder Spielen. Die Efﬁzienz von Echtzeit-Rendering Algorithmen ist entscheidend für eine ﬂüssige und schnelle Darstellung der virtuellen 3D-Szenen in einem Walkthrough-System. Es gibt verschiedene algorithmische An- sätze, um hochkomplexe geometrische 3D-Daten zu reduzieren und eine Darstellung der Daten in Echtzeit zu erreichen. In der Vorlesung werden algorithmische Ansätze aus den Bereichen Visibility-Culling, Simpliﬁcation, Level of Detail, Image-Based Rendering und weitere vorgestellt.  Einleitung: Walkthrough-Problem  Datenstrukturen: kd-Baum, BSP-Baum, Octree, Loose-Octree  Level of Detail: Adaptives LOD-Management, Mesh Simpliﬁcation, Progressive Meshes  Visibility Culling: View Frustum Culling, Potentially Visible Sets (PVS), Dynamische Be- rechnung der PVS, Hierarchischer Z-Buffer, Hierarchische Occlusion Maps, Aspect-Graph, Visibility Space Partition  Replacement: Color-Cubes, Randomisierter Z-Buffer, Hierarchical Image Caching  Paralleles Rendern: Klassiﬁzierung und Modellierung, Paralleles Rendering als Sortierpro- blem, Hybrides Sort-First/Sort-Last-Rendering 5 Lernergebnisse und Kompetenzen: Die Studierenden können die wichtigsten Techniken im Bereich der Echtzeit-Darstellung virtueller 3D-Szenen anwenden. Sie können entscheiden, in welcher virtuellen 3D-Szene welcher Algorith- mus geeignet ist. Sie können Algorithmen an neue Situationen anpassen. Nichtkognitive Kompetenzen  Haltung und Einstellung  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Algorithms for Synthesis and Optimization of Integrated Circuits: Die Veranstaltung behandelt die wesentlichen Schritte bei der Synthese digitaler Schaltungen und geht speziell auf die Übersetzung von Beschreibungen in Hardwarebeschreibungssprachen in Schaltungen ein. Weiterhin werden die wichtigsten Techniken für die Logikoptimierung diskutiert. In praktischen Übungen wird die efﬁziente Verwendung von Entwurfswerkzeugen geübt.  Hardwarebeschreibungssprachen  High-level Synthese und Optimierungsmethoden (Scheduling und Bindung)  Logikrepräsentation und Optimierung von zweistuﬁgen Logikfunktionen  Datenstrukturen für die Logiksynthese (Binary Decision Diagrams)  Repräsentation und Optimierung von mehrstuﬁgen Schaltnetzen (algebraische Methoden, Kontrollierbarkeit, Beobachtbarkeit und Veriﬁkation des Zeitverhaltens)  Modellierung und Optimierung von sequentiellen Schaltungen (Retiming)  Bibliotheken und Bindung 5 Lernergebnisse und Kompetenzen: Die Studierenden sind nach dem Besuch der Lehrveranstaltung in der Lage,  zwischen den verfügbaren Optimierungsmethoden für den digitalen Schaltungsentwurf aus- zuwählen,  die wesentlichen Probleme bei Entwurf integrierter Schaltungen zu identiﬁzieren und die Tradeoffs beim Schaltungsentwurf zu erkennen, und  aktuelle Werkzeuge für den digitalen Schaltungsentwurf zu bewerten. Nichtkognitive Kompetenzen  Gruppenarbeit  Lernkompetenz 263   6  ,  Inhalte: Inhalte der Lehrveranstaltung Approximate Computing: Approximate Computing ist ein aktueller Ansatz, der die Genauigkeit von Berechnungen reduziert und dadurch signiﬁkante Einsparungen im Energieverbrauch, der Rechenzeit oder der Chipﬂäche erzielt. Dieser forschungsorientierte Kurs führt in das Gebiet des Approximate Computing ein und stellt die wesentlichen Methoden für die Implementierung efﬁzienter Rechnersysteme durch Re- duktion der Genauigkeit vor. Der Kurs behandelt Approximationstechniken auf allen Ebenen eines Rechnersystems, von der Anwendungsebene bis hin zur Ebene der Hardwaretechnologie. In den Übungen/Tutorium wird die Efﬁzienz dieser Techniken für verschiedene Anwendungsdomänen, wie zum Beispiel Deep Learning und Digital Signal Processing, untersucht.  Einführung und Motivation für ungenaues Rechnen  Approximation in der Anwendungsebene  Programmiersprachen/Compiler für Approximate Computing  Approximation in der Mikroarchitektur  Synthese von approximierten Schaltungen  Ungenaue arithmetische Komponenten und Performanceoptimierung durch Reduktion der Genauigkeit  Approximationstechniken in der Technologieebene  Übungen/Tutorial: Approximation von Algorithem des Deep Learning und Digital Signal Pro- cessing auf der Anwendungs- und Architekturebene 283   5 Lernergebnisse und Kompetenzen: Die Studierenden sind nach dem Besuch der Lehrveranstaltung in der Lage,  die Approximationstechniken auf den unterschiedlichen Ebenen eines Rechnersystems zu benennen und zu erklären,  die wesentlichen technischen/wissenschaftlichen Problemstellungen bei der Approximation von Rechnersystemen zu identiﬁzieren,  die Einsetzbarkeit der Approximationstechniken für verschiedene Anwendungsdomänen zu beurteilen und  die Approximationstechniken anzuwenden, um efﬁziente Hardwarebeschleuniger zu reali- sieren, insbesondere für Deep Learning und Digital Signal Processing Nichtkognitive Kompetenzen  Lernkompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Architektur paralleler Rechnersysteme: Diese Veranstaltung führt in Rechnerarchitekturen der wichtigsten Parallelrechner und in die Nutzung dieser Systeme ein. Der Schwerpunkt der Veranstaltung liegt auf High-Performance- Computer.  Paralleles Rechnen aus Sicht des Anwenders  Programmierung von Parallelrechnern  Grundlagen der Rechnerarchitektur  Übersicht der Architekturen paralleler Rechnersysteme  Speichergekoppelte Systeme  Cache-Kohärenz in skalierbaren Rechnersystemen  Hochgeschwindigkeitskommunikationsnetzwerke  Datacenter Architekturen  Energieefﬁzienz 313   5 Lernergebnisse und Kompetenzen:  Studierende benennen und erklären Programmierparadigmen paralleler Programmierspra- chen. Sie beherrschen grundlegende Sprachkonstrukte und Bibliotheksfunktionen wichti- ger paralleler Programmiersprachen/-umgebungen (z.B. OpenMP , POSIX-Threads, MPI, PGAS) und können deren Einsatzgebiete benennen.  Studierende sind in der Lage sowohl einige aktuelle HPC-Systeme als auch moderne Prozessoren mit deren Eigenschaften zu beschreiben. Sie erkennen bedeutende Trends (Power Wall, Memory Wall, ILP Wall) denen diese Systeme unterliegen.  Studierende benennen und erklären allgemein genutzte Klassiﬁkation von Parallelrechnern. Sie erklären die wichtigsten Strukturbausteine und Operationsprinzipien paralleler Rech- nersysteme. Sie beherrschen die theoretische Beschreibung des Skalierungsverhaltens (Amdahl, Gustafson) und die quantitativen Bewertungen von Parallelrechnern.  Studierende benennen und erklären Architekturmerkmale skalierbarer speichergekoppelte Systeme. Sie beherrschen unterschiedliche Techniken zur Aufrechterhaltung der Speicher- konsistenz und –koherenz in busbasierten Systemen (Invalidierungs-, Update-Protokolle). Sie sind in der Lage Techniken zur Steigerung der Leistungsfähigkeit dieser Systeme zu beschreiben (Multi-Level-Caches, transiente Zustände, Split-Transaktion-Busse).  Studierende erklären Mechanismen zur Synchronisation (Locks, Barrieren) in Parallelrech- nern.  Studierende demonstrieren Kenntnisse in Aufrechterhaltung der Cache-Kohärenz von ska- lierbaren Rechnersystemen (hierarchisches Snooping, Directories). Sie beherrschen Tech- niken zur Steigerung der Leistungsfähigkeit solcher Systeme (z.B. Latenz-Verbesserung, Durchsatzerhöhung).  Studierende beschreiben Verfahren basierend auf Token Coherence. Studierende benen- nen und erklären grundlegende Eigenschaften von Cluster-Architekturen. Sie können die in dem Bereich eingesetzte Kommunikationsnetzwerke topologisch beschreiben und bewer- ten (z.B. Grad, Durchmesser, Bisektion). Sie beherrschen Kommunikationstechniken der Hochgeschwindigkeitsnetzwerke (Wormhole Routing, Virtual Cut-Through) und Routing- Verfahren (tabellenbasiertes Routing, Source-Routing). Sie beherrschen Beweistechniken zur Sicherstellung der Deadlock-Freiheit von Routings.  Studierende können die Eigenschaften existenter Interconnects (z.B. InﬁniBand, OmniPath) benennen.  Die Studierenden sind in der Lage, wesentliche Architektureigenschaften von parallelen Rechnersystemen zu erkennen und deren Eignung für bestimmte Anwendungsgebiete fest- zustellen. Die Kenntnisse können dazu eingesetzt werden um hohe Rechenleistungen auf HPC-Systemen zu erzielen und vorhandene Ressourcen efﬁzient zu nutzen. Nichtkognitive Kompetenzen  Einsatz und Engagement  Lernkompetenz 323   6  ,  Inhalte: In diesem Modul werden wechselnde Lehrveranstaltungen, beispielsweise von Gastdozenten an- geboten. Die konkreten Inhalte sind den Lehrveranstaltungen zu entnehmen. Inhalte der Lehrveranstaltung Privacy Enhancing Technologies: Dieser Kurs vermittelt den Teilnehmern ein grundlegendes Verständnis der Risiken für die Pri- vatsphäre, der gängigsten Technologien zu deren Bewältigung (“PETS”) und der menschlichen Faktoren, die deren Gestaltung beeinﬂussen. 5 Lernergebnisse und Kompetenzen: Nichtkognitive Kompetenzen  Haltung und Einstellung  Selbststeuerungskompetenz 6  ,  Inhalte: In diesem Modul werden wechselnde Lehrveranstaltungen, beispielsweise von Gastdozenten an- geboten. Die konkreten Inhalte sind den Lehrveranstaltungen zu entnehmen. Inhalte der Lehrveranstaltung Software Engineering for Self-Adaptive Systems: Die Komplexität von Softwaresystemen, die Evolution von Anforderungen und die Unsicherheit von Anforderungen und Umgebungen erschweren das Management laufender Systeme. Eine vielversprechende Lösung sind selbst-adaptive Systeme, die in der Lage sind, sich automa- tisch an sich ändernden Anforderungen und Umgebungen anzupassen. In der Vorlesung werden die Grundlagen als auch Methoden und Techniken für die Entwicklung und Absicherung selbst- adaptiver Software behandelt. Der Fokus liegt dabei auf dem Software Engineering für selbst- adaptive Systeme und der Auswirkung der Selbst-Adaption auf die Engineering-Aktivitäten. Auf Basis von Forschungsprototypen (sog. “Exemplars”) werden ausgewählte Methoden und Techni- ken in den Übungen und im Projekt erprobt. Inhalte der Lehrveranstaltung Privacy Enhancing Technologies: Dieser Kurs vermittelt den Teilnehmern ein grundlegendes Verständnis der Risiken für die Pri- vatsphäre, der gängigsten Technologien zu deren Bewältigung (“PETS”) und der menschlichen Faktoren, die deren Gestaltung beeinﬂussen. 5 Lernergebnisse und Kompetenzen: Nichtkognitive Kompetenzen  Haltung und Einstellung  Selbststeuerungskompetenz 363   6  ,  Inhalte: Inhalte der Lehrveranstaltung Build It, Break It, Fix It: Das Ziel dieser Lehrveranstaltung ist die praktische Vermittlung von Grundprinzipien der sicheren Softwareentwicklung. Sie ist inspiriert vom “Break It, Build It, Fix It”-Wettbewerb von Ruef et al. Die Veranstaltung ist in drei Phasen aufgeteilt, in denen die Teilnehmenden in Gruppen ihre Fer- tigkeiten in der Entwicklung von Software, Identiﬁzierung von Sicherheitslücken und Behebung derselben unter Beweis stellen und weiterentwickeln. In der “Build It”-Phase entwickeln die Gruppen kleine Softwareprojekte nach einer formalen Spezi- ﬁkation, die auch Sicherheitsanforderungen enthält. In der “Break It”-Phase werden die entwickel- ten Softwareprodukte unter den Gruppen ausgetauscht mit der Zielsetzung, Schwachstellen in anderen Implementierungen zu ﬁnden und auszunutzen. In der “Fix It”-Phase behebt jede Grup- pe die in ihrer Software gefundenen Schwachstellen. Die Veranstaltung enthält einen theoretischen Teil, in dem grundsätzliche Vorgehensweisen zur sicheren Softwareentwicklung erläutert, sowie verschiedene Arten von Sicherheitslücken vorge- stellt und demonstriert werden. Der Fokus dieser Veranstaltung liegt jedoch auf der praktischen Arbeit in den Gruppen. Da das Finden und Beheben von Schwachstellen in Software eine Vielzahl von Fertigkeiten und einiges an Kreativität erfordert, ist für ein erfolgreiches Absolvieren der Veranstaltung ein hohes Maß an Eigenmotivation und Selbstorganisation erforderlich. 5 Lernergebnisse und Kompetenzen: Theoretische/Praktische Kenntnisse im Bereich der sichere Softwareentwicklung. Theoreti- sche/Praktische Kenntnisse in der Aufﬁndung und Ausnutzung von Software-Sicherheitslücken. Wissen über verbreitete, reale Sotware-Sicherheitslücken und Möglichkeiten diese auszunutzen. Nichtkognitive Kompetenzen  Einsatz und Engagement  Kooperationskompetenz  Lernkompetenz  Selbststeuerungskompetenz 393   6  ,  Inhalte: Inhalte der Lehrveranstaltung Clustering Algorithms: Im Zentrum dieser Vorlesung steht eines der wichtigsten Werkzeuge der Datenanalyse. das Clus- tering. Clustering ist der Prozess des Aufteilen von Daten in sinnvolle oder nützliche Teilmengen. Eine solche Aufteilung sollte die natürliche Struktur der Daten widerspiegeln. Dies kann z.B. be- deuten, dass jede Teilmenge möglichst viele einander ähnliche Objekte einer Datenmenge ent- halten soll. Clustering ist eine natürliche Art Daten zu strukturieren und zu analysiere. Es besitzt viele Anwendung in den Natur- und Ingenieurwissenschaften.  Agglomeratives Clustering  K-Means Clustering  Geometrisches Clustering: DBSCAN  Dimensionsreduktion: Johnson-Littlewood und SVD  Stochastische Modelle und EM-Algorithmus 5 Lernergebnisse und Kompetenzen: Studierende können die wichtigsten Algorithmentechniken des Clustering benennen und erläu- tern. Sie können entscheiden, in welcher Situation welcher Algorithmus geeignet ist. Sie können Algorithmen an neue Situationen anpassen. Sie kennen verschiedene Modellierungen von Clus- tering, können diese anwenden und anpassen sowie für die Modellierung geeignete Algorithmen einsetzen und bewerten. Nichtkognitive Kompetenzen  Lernkompetenz  Schreib- und Lesekompetenz (wissenschaftlich)  Selbststeuerungskompetenz 413   6  ,  Inhalte: Inhalte der Lehrveranstaltung Combinatorial Optimization: Dieser Kurs bietet eine Einführung in die kombinatorische Optimierung. Algorithmische Ansätze und Methoden werden vorgestellt und analysiert, und es werden verschiedene kombinatorische Optimierungsprobleme betrachtet. Themen des Kurses sind z.B. Matchings, Netzwerkﬂüsse und lineare Programmierung. 5 Lernergebnisse und Kompetenzen: Den Teilnehmenden werden algorithmische Ansätze für kombinatorische Optimierungsprobleme vermittelt sowie ein Verständnis für die Komplexität der Probleme und die Grenzen der vorgestell- ten Methoden. Nichtkognitive Kompetenzen  Haltung und Einstellung  Selbststeuerungskompetenz 433   6  ,  Inhalte: Inhalte der Lehrveranstaltung Computational Argumentation: Argumentation ist ein zentraler Bestandteil der Kommunikation in Alltag und Beruf. Wo Kontrover- sen auftreten, spielen auch Argumente eine Rolle - zur Meinungsbildung, zur Entscheidungsﬁn- dung oder zur Überzeugung anderer. In den letzten Jahren hat sich die algorithmische Analyse und Synthese solcher natürlichsprachiger Argumentation (kurz: Computational Argumentation) zu einem aufstrebenden Bereich in der Forschungswelt entwickelt. Es wird davon ausgegangen, dass Computational Argumentation die nächste Generation von Suchmaschinen und intelligenten Assistenzsystemen maßgeblich beeinﬂusst. Aufbauend auf grundlegenden Techniken der Verar- beitung natürlicher Spache, umfasst Computational Argumentation unter Anderem die Extraktion von Argumenten aus natürlichsprachigem Text, die Bewertung der Qualität von Argumenten, wie auch die Ermittlung von Argumenten in der Web-Suche. 5 Lernergebnisse und Kompetenzen: Studierende lernen sowohl linguistische und argumentationstheoretische Grundlagen als auch State-of-the-Art-Techniken aus dem Bereich Computational Argumentation theoretisch kennen und erlernen den praktischen Einsatz entsprechender Methoden. Nichtkognitive Kompetenzen  Haltung und Einstellung  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Data-Driven Innovation and Engineering: Die Digitalisierung verändert die Marktleistungen von morgen sowie die Art und Weise, wie diese entwickelt werden. Tradierte Methoden der Strategischen Planung und des System Engineering lassen Potentiale ungenutzt; während datengetriebene Lösungen diese Potentiale erfassen. Die Vorlesung schafft einen Überblick der Herausforderungen und zu Lösungsansätzen von Data- Driven Innovation and Engineering. Es werden theoretische Grundlagen und Konzepte eingeführt und exemplarische Anwendungen aus der Praxis vorgestellt. Dabei wird der Prozess von der Da- tenerfassung über Möglichkeiten zur Datenauswertung bis hin zur Entwicklung innovativer Markt- leistungen betrachtet. Das erlangte Wissen wird in den Übungen vertieft und umgesetzt. 5 Lernergebnisse und Kompetenzen: Die Studierenden erhalten ein umfassendes Verständnis für datengetriebene Lösungen im Be- reich Data-Driven Innovation and Engineering. Ferner erlernen die Studierenden die eigenständi- ge Entwicklung datengetriebener Lösungen. Nichtkognitive Kompetenzen  Einsatz und Engagement  Empathie  Gesellschaftliche und ethische Urteilsfähigkeit  Gruppenarbeit  Kooperationskompetenz  Motivationale und volitionale Fähigkeiten  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Data Science for Physics and Engineering: Datenbasierte Methoden haben in den vergangenen Jahren die Modellierung, Vorhersage und Steuerung komplexer Systeme revolutioniert. In dieser Vorlesung behandeln wir die Grundlagen aus den Bereichen Maschinelles Lernen ,Ingenieurwissenschaften sowie mathematischer Phy- sik, um moderne Verfahren aus dem Bereich Data Science in die Modellierung und Steuerung komplexer Systeme zu integrieren. Wir behandeln auch aktuelle Fortschritte im Bereich des wis- senschaftlichen Rechnens , die es ermöglichen, datenbasierte Methoden in einer Vielzahl von Anwendungen einzusetzen, zum Beispiel Fluiddynamik, Gehirnströme, Klima, Epidemiologie, Fi- nanzen oder Robotik. Die behandelten Themenblöcke sind:  Mustererkennung und Dimensionsreduktion  Koordinatentransformationen  Maschinelles Lernen und Datenanalyse  Dynamische Systeme und Kontrolle  Reduzierte Modelle 5 Lernergebnisse und Kompetenzen: Studenten lernen  Faktenwissen über –die Grundlagen maschineller Lernverfahren im Kontext technischer und physikalischer Systeme –Grundlagen aus dem Bereich der Vorhersage und Steuerung dynamischer Systeme –mathematische Grundlagen der datenbasierten Modellreduktion  Methodisches Wissen über –verschiedene, in den datenbasierten Ingenieurwissenschaften weit verbreitete Ansät- ze zur efﬁzienten Datenverarbeitung und -auswertung –die interdisziplinäre Verknüpfung verschiedener Methoden zur Lösung komplexer Pro- blemstellungen  Transfer-Wissen, u.a. die Fähigkeit –die Methoden auf neue Systeme und Problemklassen zu übertragen –etablierte Methoden des maschinellen Lernens für speziﬁsche Problemklassen ge- schickt miteinander zu verknüpfen  Normatives Wissen, unter anderem die Fähigkeit folgendes zu bewerten –Die Eignung bestimmter Methoden hinsichtlich der verfügbaren Datenmenge, der Systemkomplexität, etc. –den Aufwand und die Machbarkeit von datenbasierte Projekten im ingenieurwissen- schaftlichen Kontext Nichtkognitive Kompetenzen  Lernkompetenz  Lernmotivation 503   6  ,  Inhalte: Inhalte der Lehrveranstaltung Data Science in Industrial Applications: Die zunehmende Vernetzung von Maschinen, Sensoren und IT -Systemen vor dem Hintergrund der Industrie 4.0 hat zu einem rapiden Anstieg der verfügbaren Datenmengen geführt. Die Aus- wertung der Daten bietet ein enormes Potential für die Automatisierung von kognitiven Aufgaben, die Optimierung von Prozessen und die weitergehende Wertschöpfung aus Daten. Die Vorlesung gibt einen Überblick zu den Herausforderungen und Lösungsansätzen für die in- dustrielle Anwendung von Data Science. Dies umfasst die Einbindung industrieller Datenquellen aus dem Feld, die IT -Landschaft in produzierenden Unternehmen und den Aufbau von (Big Data) Infrastruktur, typische Algorithmen im Bereich Zeitreihenverarbeitung, Optimierung oder Bildver- arbeitung sowie die Einbettung in Unternehmensprozesse. Theoretische und methodische Grundlagen, Konzepte und Tools werden im Rahmen der Vorle- sung eingeführt und anhand einer Case Study in Kleingruppen angewendet sowie in Heimübun- gen vertieft. Dabei werden Kompetenzen in der Gruppenarbeit und Kooperation, Selbststeuerung sowie Projektmanagement vertieft. 523   5 Lernergebnisse und Kompetenzen: Die Studierenden verstehen die Herausforderungen der Anwendung von Data Science in indus- triellen Anwendungen und besitzen einen Überblick typischer Anwendungsbeispiele. Sie können Methoden der Signalverarbeitung, des Maschinellen Lernens und der Statistik auf industrielle Problemstellungen anwenden sowie die Umsetzung von Datenakquise, Datenarchitektur und die Integration in Unternehmensprozesse planen. Nichtkognitive Kompetenzen  Gruppenarbeit  Kooperationskompetenz  Lernkompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Designing code analyses for large-scale software systems 1: Statische Codeanalysen dienen dazu, automatisiert Fehler und Schwachstellen im Programmco- de aufzuﬁnden. Zu diesem Zwecke suchen sie nach bekannten Fehlermustern. In dieser Vorle- sung wird erklärt, wie man solche Codeanalysen entwirft, die inter-prozedural sind, also das kom- plette Programm betrachten, über die Grenzen einzelner Prozeduren hinweg. Der Entwurf solcher Analysen gestaltet sich deshalb sehr schwierig, weil die Analysen oft Millionen von Programm- statements gleichermaßen präzise aber auch efﬁzient verarbeiten müssen. Es werden außerdem Beispielsanalysen aus dem Bereich der IT -Sicherheit besprochen. Diese Veranstaltung ist Teil einer Kombination DECA 1/2. In DECA 2 werden aktuelle Ansätze aus der Forschung besprochen. Es wird dringend empfohlen zuerst DECA 1 und dann DECA 2 zu belegen. Behandelte Themen:  Typsysteme und ﬂuss-insensitive Analysen  Endliche Verbände und Fixpunkte  Intra-prozedurale ﬂuss-sensitive Codeanalysen  Intervallanalyse, Widening und Narrowing  Erstellen von Call-graphen  Pointer-Analyse  Inter-prozedurale Codeanalysen  Context-sensitive Analyse mit dem Call-strings Approach  Context-sensitive Analyse mit dem Functional approach  Value-based Termination, VASCO  Distributive Analysen mit IFDS  Praktische Deﬁnitionen von Flussfunktionen  Distributive Analysen mit IDE Während der gesamten Veranstaltung werden Anwendungsbeispiele aus dem Gebiet der Soft- waresicherheit diskutiert. 5 Lernergebnisse und Kompetenzen: Durch den Besuch erlernen Studierende. . .  wichtige Designentscheidungen beim Entwurf automatisierter Codeanalysen richtig zu tref- fen  welche Algorithmen für Codeanalysen in welchen Anwendungssituationen am besten ge- eignet sind  wie man Codeanalysen für reale Probleme aus der IT -Sicherheit entwirft  wie man gängige Begrifﬂiche wie Kontext-, Fluss-, Feld-, und Objekt-Sensitivität korrekt interpretiert  welche Limitierungen statische Codeanalysen aufweisen  welche gängige Codeanalysen für Sicherheitsschwachstellen (OWASP Top 10 etc.) existie- ren, und wie sich diese mit den vorgestellten Algorithmen umsetzen lassen. Nichtkognitive Kompetenzen  Lernkompetenz  Lernmotivation 553   6  ,  Inhalte: Inhalte der Lehrveranstaltung Designing code analyses for large-scale software systems 2: Statische Codeanalysen dienen dazu, automatisiert Fehler und Schwachstellen im Programmco- de aufzuﬁnden. Zu diesem Zwecke suchen sie nach bekannten Fehlermustern. In dieser Vorle- sung wird erklärt, wie man solche Codeanalysen entwirft, die inter-prozedural sind, also das kom- plette Programm betrachten, über die Grenzen einzelner Prozeduren hinweg. Der Entwurf solcher Analysen gestaltet sich deshalb sehr schwierig, weil die Analysen oft Millionen von Programm- statements gleichermaßen präzise aber auch efﬁzient verarbeiten müssen. Es werden außerdem Beispielsanalysen aus dem Bereich der IT -Sicherheit besprochen. Diese Lehrveranstaltung knüpft an an die Veranstaltung DECA 1. In DECA 2 werden vor allem neuartige Konzepte direkt aus der Forschung besprochen, beispielsweise sogenannte demand- driven analyses, welche sich durch eine präzisere und gleichzeitig efﬁzientere Analyse auszeich- nen, aber auch Pushdown-Systeme, die eine elegante Modellierung und ebenso schnelle Aus- führung von Programmanalysen erlauben. Zu guter letzt erklären wir aktuelle Lösungsansätze zu praktischen Problemen in der statischen Analyse wie beispielsweise der Nutzung von Reﬂection und nativem Code. Behandelte Themen:  Programmanalyse von Software-Produktlinien  Modellierung von Call Stacks und Feldzugriffen mit Pushdown-Systemen  Modellierung von weiterer Analyseinformationen mit Weighted Pushdown Systems  Efﬁzienz- und Präzisionsgewinne durch bedarfsgesteuerte Programmanalyse  Synchronisierte Pushdown-Systeme im Boomerang-Framework  Angewandte Android-Code-Analyse mit FlowDroid  Behandlung von Reﬂexion mittels TamiFlex  Hybride statische und dynamische Analyse mit Harvester  Lernen von Quell-, Senken- und Sanitizer-Deﬁnitionen mit SWAN und SWAN Assist  Erklärbare statische Analyse Während der gesamten Veranstaltung werden Anwendungsbeispiele aus dem Gebiet der Soft- waresicherheit diskutiert. 583   5 Lernergebnisse und Kompetenzen: Durch den Besuch erlernen Studierende. . .  wichtige Designentscheidungen beim Entwurf automatisierter Codeanalysen richtig zu tref- fen  welche Algorithmen für Codeanalysen in welchen Anwendungssituationen am besten ge- eignet sind  wie man Codeanalysen für reale Probleme aus der IT -Sicherheit entwirft  wie man gängige Begrifﬂiche wie Kontext-, Fluss-, Feld-, und Objekt-Sensitivität korrekt interpretiert  welche Limitierungen statische Codeanalysen aufweisen  welche gängige Codeanalysen für Sicherheitsschwachstellen (OWASP Top 10 etc.) existie- ren, und wie sich diese mit den vorgestellten Algorithmen umsetzen lassen. Nichtkognitive Kompetenzen  Lernkompetenz  Lernmotivation 6  ,  Inhalte: Inhalte der Lehrveranstaltung Digitale Sprachsignalverarbeitung: Die Veranstaltung führt in die grundlegenden Techniken und Theorien zur digitalen Sprachsignal- verarbeitung ein. Schwerpunkt des ersten Teils der Vorlesung liegt im Themengebiet “Hören und Sprechen”, welches sich mit psychologischen Effekten der Geräuschwahrnehmung und der Spra- cherzeugung beschäftigt. Anschließend werden zeitdiskrete Signale und Systeme, sowie deren rechnergestützte Verarbeitung besprochen. Die nichtparametrische Kurzeitanalyse von Sprachsi- gnalen, die Sprachcodierung und die IP-Telefonie sind weitere Themen.  Sprechen und Hören  Spracherzeugung: menschliche Sprechorgane, Lautklassen, Quelle-Filter-Modell, Vocoder  Grundlagen Schallwellen  Hören: menschliches Hörorgan, Psychoakustik und Physiologie des Hörens, Lautheit, Ver- deckung, Frequenzgruppen  Zeitdiskrete Signale und Systeme  Grundlagen: Elementare Signale, LTI-Systeme  Transformationen: Fouriertransformation zeitdiskreter Signale, DFT, FFT  Realisierung zeitdiskreter Filterung im Frequenzbereich: Overlap-Add, Overlap-Save  Statistische Sprachsignalanalyse  Grundlagen Wahrscheinlichkeitsrechnung  Kurzzeitanalyse von Sprachsignalen: Spektrogramm, Cepstrum  Schätzung von Sprachsignalen  Optimale Filterung  LPC-Analyse  Spektrale Filterung zur Rauschunterdrückung  Adaptive Filterung: LMS Adaptionsalgorithmus, Echokompensation  Sprachcodierung  Signalformcodierung, parametrische Codierung, hybride Codierverfahren  Codierung im Frequenzbereich  Amplitudenquantisierung: gleichförmige Quantisierung, Quantisierung mit Kompandierung (ulaw, alaw) 5 Lernergebnisse und Kompetenzen: Die Studierenden sind nach Absolvieren des Moduls in der Lage,  Digitale Signale, speziell Audiosignale, im Zeit- und Frequenzbereich zu analysieren,  Sprachsignale efﬁzient zu repräsentieren und  Weit verbreitete Algorithmen zur Sprachsignalanalyse und Verarbeitung im Frequenz- oder Zeitbereich zu implementieren. Nichtkognitive Kompetenzen  Einsatz und Engagement  Lernkompetenz 613   6  ,  Inhalte: Inhalte der Lehrveranstaltung Efﬁciency in Games: Der Kurs betrachtet mehrere Lösungskonzepte und Efﬁzienzmaßnahmen in der Theorie des nicht- kooperativen Spiels und befasst sich mit den Techniken für die Grenzen der Efﬁzienz von Lö- sungen in strategischen und umfangreichen Spielen zu beweisen. Wir betrachten verschiedene Techniken und wenden sie auf wichtige Spiele an. Themen  Nicht-kooperative Spiele und Lösungskonzepte, Nash-Gleichgewichte - rein und gemischt, Soziale Wohlfahrt, Efﬁzienz (Preise bei Anarchie und Stabilität (PoA, PoS)), Normativer Ansatz hier (eher als deskriptiv)  Klassische Netzwerkbeispiele (Beispiel Routing Pigou, ein Netzwerkbildungsspiel mit har- monischem PoS, einfache Zeitplanung, Ressourcenzuweisung mit proportionaler Auftei- lung). Efﬁzienz als Leitlinie für MD.  Routing-Spiele, Nicht-atomarisches egoistisches Routing, Pigou und Braess, Atomare selbstsüchtige Streckenführung, AAE, Methode der potentiellen Funktion, Existenz und Ein- zigartigkeit von Gleichgewichtsströmen  PoA-Grenzen bei egoistischen Routing-Spielen, Reduzierung des PoA  Spiele zur Netzwerkbildung, Das lokale Verbindungsspiel und sein PoA, Mögliche Spie- le, Bounding PoS unter Verwendung der Potentialfunktionsmethode, Bewerbung: Globales Verbindungsspiel, Standort der Anlage und Versorgungsspiele  Selbstsüchtiger Lastausgleich, eine GT -Variante der Minimierung der Spannweite (der ma- ximalen Belastung), wobei die Agenten die Aufgaben sind. Die soziale Wohlfahrt ist ma- kepan, anstelle der utilitaristischen (Summe). Grenzen für reines und gemischtes PoA in verschiedenen Settings. Beste Reaktionsdynamik. Betrachten Sie schließlich Algorithmen zur Berechnung reiner Gleichgewichte.  Skalierbare Ressourcenallokation. Mechanismen der Ressourcenallokation unter der An- nahme privater Versorgungsunternehmen. Wir betrachten sowohl Nash- als auch Wettbe- werbsgleichgewichte. Der Mechanismus sollte einen niedrigen PoA (efﬁzient) haben und die Akteure sollten niedrigdimensionale Strategieräume haben. –Proportionaler Zuteilungsmechanismus. –Reibungslose Markt-Clearing-Mechanismen. –Erweiterung der Vickrey-Clarke-Groves (VCG), was einfache Strategien und einen einzigen Clearingpreis erfordert.  Korrelierte und grobkorrelierte Gleichgewichte, Robustes PoA und der Glattheitssatz von Tim Roughgarden, Bewerbungen  Wiederholte Partien, Wiederholtes PD-Beispiel, Falk-Theoreme  Efﬁzienz im Hinblick auf andere Lösungskonzepte und Deﬁnitionen der Sozialfürsorge.  Efﬁzienz und Altruismus 643   5 Lernergebnisse und Kompetenzen: Das Folgende zu deﬁnieren, zu verstehen und zu verwenden:  Nicht-kooperative Spiele  Normale(strategische) Spiele  (Reine und gemischte) Nash-Gleichgewichte  Preise der Anarchie und Stabilität  Klassische Netzwerk-Beispiele  Routing-Spiele (atomar und nicht-atomar)  Methode der potentiellen Funktion  Spiele zur Netzwerkbildung  Das lokale Verbindungsspiel  Mögliche Spiele  Globales Verbindungsspiel  Standort der Anlage und Versorgungsspiele  Selbstsüchtiger Lastausgleich  Beste Reaktionsdynamik  Proportionaler Zuteilungsmechanismus  Reibungslose Markt-Clearing-Mechanismen  Vickrey-Clarke-Groves (VCG)  Korrelierte und grobkorrelierte Gleichgewichte  Robustes PoA und das Glattheitstheorem  Wiederholte Partien  Falk-Theoreme  Altruistische Spieler Nichtkognitive Kompetenzen  Haltung und Einstellung  Lernkompetenz  Schreib- und Lesekompetenz (wissenschaftlich)  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Foundations of Cryptography: Wichtige Basiskonzepte moderner Kryptographie werden vorgestellt. Hierzu gehören Verschlüs- selungsverfahren, digitale Signaturen, Identiﬁkationsprotokolle und Mehrparteienberechnungen werden vorgestellt. In allen Fällen werden formale Sicherheitsdeﬁnitionen vorgestellt und, ausge- hend von mathematisch präzisen Annahmen, beweisbar sichere Konstruktionen entwickelt.  Symmetrische und asymmetrische Verschlüsselung  Pseudozufallsfunktionen, Einweg-Funktionen, Permutationen mit Falltüren  Hashfunctions und Authentiﬁzierungscodes  Digitale Unterschriften, Einmal-Unterschriften und Zufallsorakel  Identiﬁkationsprotokolle, S-Protokolle  Sichere Mehrparteienberechnungen 5 Lernergebnisse und Kompetenzen: Studierende verstehen wesentliche Konzepte und Methoden moderner Kryptographie. Sie kön- nen für Sicherheitsprobleme geeignete kryptographische Techniken auswählen. Sie können Ba- sistechniken der Kryptographie kombinieren und modiﬁzieren, neue Sicherheitskonzepte deﬁnie- ren und die Sicherheit der Konstruktionen bezüglich dieses Deﬁnitionen beweisen. Nichtkognitive Kompetenzen  Einsatz und Engagement  Gruppenarbeit  Lernmotivation  Schreib- und Lesekompetenz (wissenschaftlich)  Selbststeuerungskompetenz 673   6  ,  Inhalte: Inhalte der Lehrveranstaltung Foundations of Knowledge Graphs: In dieser Lehrveranstaltung werden Verfahren zur Extraktion, Speicherung, Integration und An- wendung von Wissensgraphen vorgestellt. Wissensextraktionsverfahren für unstrukturierte Daten (insbesondere Verfahren zur Erkennung und Disambiguierung von Entitätsnamen sowie zur Ex- traktion von Relationen) bilden den Kern der Exkrationsverfahren. Triple Stores zur Speicherung von RDF bilden den darauf folgenden Schwerpunkt. Zeitefﬁzienten und akkuraten Verfahren der Wissensintegration und zur Vorhersage von Verknüpfungen folgen eine Reihe von Anwendungen basierend auf RDF Daten.  Semantische Netzwerke  Property Graphen  RDF Graphen  Anfragesprachen (e.g., Cypher, SPARQL)  Wissensextraktion aus Text  Wissensextraktion aus semi-strukturierten Daten  Entdeckung von Verknüpfungen  Maschinelle Lernverfahren  Faktorisierung 693   5 Lernergebnisse und Kompetenzen: Die Studierenden sind nach Absolvieren des Moduls in der Lage  Wissensgraphen zu modellieren;  die formale Semantik von Modellierungssprachen zu beschreiben;  formale Ontologien zu erarbeiten und auf Konsistenz zu prüfen;  efﬁziente imperative und deskriptive Anfragen zu gestalten;  Wissensextraktionsmodelle zu trainieren und auszuführen. Nichtkognitive Kompetenzen  Gruppenarbeit  Lernkompetenz  Medienkompetenz  Schreib- und Lesekompetenz (wissenschaftlich) 6  ,  Inhalte: Inhalte der Lehrveranstaltung Game Theory: Der Kurs führt eine Person in die Theorie des nicht-kooperativen und kooperativen Spiels ein. Die Studierenden erhalten einen breiten Überblick über die Zweige der Spieltheorie, und tauchen anschließend in nicht-kooperative Lösungskonzepte und Efﬁzienzmaßnahmen ein. Wir betrachten mehrere Modelle und wichtige Klassen solcher Spiele. Der zweite Teil des Kurses befasst sich mit kooperativen Lösungskonzepten und Klassen von Spielen. Themen  Spieltheoretische Bereiche (nicht-kooperative, kooperative, MD (Auktionen, etc.), epis- temische GT, evolutionäre GT, Logik in GT, etc.), Nutzentheorie (Von-Neumann Mor- genstern) und Rationalitätsannahme, Normativer Ansatz hier (eher als deskriptiv), Nicht- kooperative Spieltheorie: Normalform-Spiele, Umfangreiche Spiele, Prägnante Darstellun- gen (Polymatrix-Spiele, graﬁsche Spiele usw.), (Un)vollständige und (un)perfekte Informati- onsannahmen, (Un)endliche Spiele  Normale (= strategische) Formspiele: (Reines) Nash-Gleichgewicht, Beispiele (auch für Nicht-Existenz), Efﬁzienz (Preise bei Anarchie und Stabilität (PoA, PoS)), Stark/schwach dominierende Strategien, Beispiel für Auktionen (1. und 2. Preis), Stark/schwach dominier- te Strategien, Eliminierung (ordnungsabhängig für Schwache und unabhängig für Starke), Der Einﬂuss der Eliminierung auf NE  (Genaue) potentielle Spiele, Äquivalenz zu Stauspielen  Nullsummen-Spiele, (Maxmin, Minmax, Wert, Austauschbarkeit von NE-Strategien)  Gemischte Verlängerung, Gemischt NE, (Endliche Existenz)  Eigenschaften von gemischtem NE, allgemein (gemischte Dominanz), symmetrische Spie- le, Konstante-Summe, Potential Gemischtes NE ﬁnden (allgemeine Alg. und Beispiele), Rationalisierbarkeit  Soziale Wohlfahrt, Preise der Anarchie und Stabilität, Beispiele (Koordination, Streckenfüh- rung, etc.)  Korreliertes und grobkorreliertes Gleichgewicht, Starkes Nash-Gleichgewicht, Evolutio- näres Gleichgewicht und evolutionäre Spiele  Umfangreiche Spiele, Eine erfolgreiche Strategie und Nachweistechniken, Zermelo- Algorithmus, Beispiele: Schach, Dame, Mampf  SPE, Existenz  (Un)endlich wiederholte Spiele (Gefangenendilemma usw.), Falk-Theoreme  Kooperative Spiele: Nicht übertragbarer und übertragbarer Nutzen, Allgemeine Eigenschaf- ten, Übertragbarer Nutzen: Einfache Spiele  Kern, Bondareva-Shapley-Charakterisierungstheorem  Der Shapley-Wert und seine axiomatische Charakterisierung 723   5 Lernergebnisse und Kompetenzen: Das Folgende zu deﬁnieren, zu verstehen und zu verwenden:  Allgemeine Bereiche von GT  Nicht-kooperative Spiele  Normale(strategische) Spiele  Nash-Gleichgewichte, dominante Strategien  Preise der Anarchie und Stabilität  Mögliche Spiele  Stauspiele  Spiele mit konstanter Summe  Gemischter NE, Existenz und Finden dieser Gleichgewichte  Rationalisierbarkeit  Grenzen der Efﬁzienz  Korrelierte und grobkorrelierte NE  Starker NE  Evolutionäre stabile Strategie  Umfangreiche Spiele  Gewinnstrategie  Zermelo-Algorithmus  Teilspiel perfektes Gleichgewicht  Wiederholte Spiele und Falk-Sätze  Kooperative Spiele  Übertragbarer Nutzen  Einfache Spiele  Kern  Bondareva-Shapley-Satz  Der Shapley-Wert und seine axiomatische Charakterisierung Nichtkognitive Kompetenzen  Haltung und Einstellung  Lernkompetenz  Schreib- und Lesekompetenz (wissenschaftlich)  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung High-Performance Computing: Die Veranstaltung vermittelt Grundlagen des Hochleistungsrechnen (High-Performance Compu- ting) mit einem Schwerpunkt auf der Programmierung von parallelen Rechnersystemen und neu- artiger Hardwarebeschleuniger.  Einführung in High-Performance Computing  Modelle und Programmiermuster für paralleles Rechnen  Programmiersprachen und Bibliotheken für HPC  Performanceanalyse, Optimierung und Debugging  Heterogenes Rechnen mit Hardwarebeschleunigern  Fallstudien 753   5 Lernergebnisse und Kompetenzen: Die Studierenden sind nach dem Besuch der Lehrveranstaltung in der Lage,  Modelle und Programmiermuster für HPC zu benennen und die passenden Muster für eine gegebenen Anwendung zu identiﬁzieren,  die Grundkonstrukte der gängigen HPC Bibliotheken, insbesondere MPI, OpenMP und OpenCL, anzugeben und anzuwenden,  die Performance von Anwendungen durch Verwendung von Proﬁlaingwerkzeugen zu ana- lysieren und systematisch passende Optimierungsstrategien abzuleiten,  die gelernten Konzepte und Verfahren auf existierende Anwendungen anzuwenden und diese zu parallelisieren und optimieren. Nichtkognitive Kompetenzen  Gruppenarbeit 6  ,  Inhalte: Inhalte der Lehrveranstaltung Information Retrieval: Ziel der Vorlesung sind die Grundlagen von Suchmaschinen. Wir untersuchen grundlegende Modelle für Suche (Boolesche Modelle, Vektorräume, Wahrscheinlichkeiten) wie auch die ent- sprechenden Ansätze, die benötigt werden, um Suchresultate efﬁzient zu verarbeiten (Clustering, Klassiﬁkation).  Boolesches Modell  Indexing  Vektorräume und darauf aufbauende Modelle  Probabilistische Modelle  Klassiﬁkation und clustering  PageRank-Algorithmus 5 Lernergebnisse und Kompetenzen: Nach dem Absolvieren des Moduls verfügen die Studierenden über folgende Fähigkeiten:  Sie verstehen die Grundlagen von Suchmaschinen.  Sie sind in der Lage, Repräsentationsmechanismen für Dokumente und Texte anzugeben, zu beschreiben, zu vergleichen.  Sie können ein geeignetes Modell (Bool’sches Modell, Vektorraummodell, probabilistisches Modell) für ein Suchproblem auswählen oder Mischformen entwickeln.  Sie können die Efﬁzienz der entstehenden Verfahren abschätzen. Nichtkognitive Kompetenzen  Gruppenarbeit  Lernkompetenz  Medienkompetenz  Schreib- und Lesekompetenz (wissenschaftlich) 6  ,  Inhalte: Inhalte der Lehrveranstaltung Introduction to Quantum Computation: In dieser Vorlesung werden die Grundlagen von Quanteninformatik und Quanteninformation vor- gestellt. Das umfasst eine Einführung in Quantenmechanik, Quantenverschränkung, Quantenal- gorithmen, Quantenfehlerkorrektur und Quanteninformation.  Quantenmechanik  Quantenverschränkung  Quantenalgorithmen  Quantenfehlerkorrektur  Quanteninformation 5 Lernergebnisse und Kompetenzen: Studierende können:  die Postulate von Quantenmechanik beschreiben und benutzen,  die Benutzung von Quantenverschränkung als eine Quelle verstehen,  grundlegenden Quantenalgorithmen entwickeln und analysieren  Quantenfehlerkorrektur benutzen,  grundlegender Quanteninformationskonzepten, wie Entropie, verstehen und benutzen, Nichtkognitive Kompetenzen  Lernkompetenz  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Kontextuelle Informatik: Informatiker entwickeln auf Zeichen basierende Produkte (Programme, Speziﬁkationen, Doku- mentationen etc.), die einen speziﬁschen Gegenstandsbereich modellieren. Bei der Entwicklung solcher Produkte stellen sich vielfältige Fragen: Wie können die zu verarbeitenden Daten sowie die umzusetzenden Prozesse angemessen modelliert werden? Welche Konsequenzen ergeben sich aus der Möglichkeit, Systeme interaktiv zu gestalten? Welche Rolle wird beim Einsatz der Software den Benutzern, welche der Software zuteil? Welche Rahmenbedingungen des Einsatz- kontexts sind dabei zu beachten? Die Veranstaltung erörtert die im weiteren Verlauf relevanten Grundbegriffe der Informatik mit besonderem Augenmerk auf die Unterscheidung zwischen technischen Konzepten und der Nut- zungssphäre. Vor diesem Hintergrund werden Theorien interaktiver Systeme betrachtet, um ins- besondere die Rolle digitaler Medien für geistige Prozesse untersuchen. Bei der Entwicklung von Informatiksystemen müssen die relevanten Daten und Prozesse bis zu einem gewissen Grad antizipiert und als formales System beschrieben werden. Dies wirft Fragen auf, unter welchen Be- dingungen eine solche formale Beschreibung adäquat erfolgen kann und welche Konsequenzen sich daraus in Bezug auf die Zuverlässigkeit und den verantwortbaren Einsatz von Informatiksys- temen ergeben.  Grundbegriffe der Informatik  Digitale Medien und geistige Prozesse  Ersetzungs- und Unterstützungsparadigmen  Modellierung und Formalisierung von Daten und Prozessen  Rechtliche und ethische Fragestellungen 5 Lernergebnisse und Kompetenzen: Die Studierenden lernen, theoriegeleitet die Bedeutung von interaktiven Systemen zu untersu- chen. Sie verstehen, technische und nicht-technische Problemstellungen zu differenzieren und adäquat aufeinander zu beziehen. Des Weiteren werden sie in die Lage versetzt, aktuelle techno- logische Entwicklungen zu bewerten und zu vergleichen sowie Innovationspotenziale im Bereich digitaler Medien abschätzen zu können. Nichtkognitive Kompetenzen  Gesellschaftliche und ethische Urteilsfähigkeit  Haltung und Einstellung  Medienkompetenz  Schreib- und Lesekompetenz (wissenschaftlich) 823   6  ,  Inhalte: Inhalte der Lehrveranstaltung Logic Programming for Artiﬁcial Intelligence: Diese Lehrveranstaltung betrachtet verschiedene Konzepte und Techniken der Informatik, der Künstlichen Intelligenz and der Computerlinguistik aus einer anderen Perspektive, aus der Per- spektive der Logikprogrammierung. Logikprogrammierung im Allgemeinen und die Programmier- sprache Prolog im Besonderen erlauben es, viele Konzepte deklarativ in Logik zu beschreiben und gleichzeitig durch einen Intepreter zu testenund auszuführen. Dies eignet sich besonders für die Lösug von Puzzle- und Quiz-Aufgaben, aber auch für selbst deﬁnierte und Domänen- speziﬁsche Sprachen.  Einführung in Logikprogrammierung am Beispiel der Programmiersprache Prolog  Constraint-Lösungssysteme, Puzzles, und Theorem-Beweiser  Interpreters für Termersetzungssysteme  Parsen von Programmen, XML-Daten und natürlicher Sprache  Semantik-Konstruktion, Frage-Antwort-Systeme und Text-Übersetzung  Meta-Interpreter, Domänen-speziﬁsche Sprachen und Programmieren in “natürlicher Spra- che”  Feature-Term-Uniﬁkation und Anwednungen in Computerlinguistik und E-Commerce 843   5 Lernergebnisse und Kompetenzen: Studenten lernen Faktenwissen über  die Transformation von Wissen, das als Fakten und Regeln gegeben ist, in ausführbare Programme  die Programmierung in Logik und in selbst entworfenen Sprachen Methodisches Wissen, unter anderem die Fähigkeit:  Domänen-speziﬁsche Sprachen zu deﬁnieren  Interpreter für Domänen-speziﬁsche Sprachen zu implementieren  kleine Frage-Antwort-Systeme zu implementieren  Software zu entwickeln für Theorembeweiser, Constraint-Solver und zur Lösung von Puzz- les Transfer-Wissen, u.a. die Fähigkeit:  die Methoden auf neue Probleme, Kalküle und Wissensrepräsentationsformate zu übertra- gen  das Wissen über Parsing und Semantik-Konstruktion auf Domänen-speziﬁsche Sprachen zu übertragen Normatives Wissen, unter anderem die Fähigkeit folgendes zu bewerten:  die Eignung und die Grenzen verschiedener Daten- und Wissensrepräsentationsformate für verschiedene Aufgaben  die Eignung verschiedener Programmier-Paradigmen für verschiedene Projekte  den Aufwand und die Machbarkeit von Projekten mit dem Ziel natürliche Sprache zu ver- stehen  den Aufwand und die Machbarkeit von Projekten mit dem Ziel natürliche Sprache zu über- setzen Nichtkognitive Kompetenzen  Lernkompetenz  Lernmotivation 6  ,  Inhalte: Inhalte der Lehrveranstaltung Machine Learning I: Aufgrund der stetig wachsenden Menge an Daten, die in unserer Informationsgesellschaft sys- tematisch produziert wird, hat das Maschinelle Lernen in den letzten Jahren mehr und mehr an Bedeutung gewonnen, nicht nur als wissenschaftliche Disziplin sondern auch als Schlüsseltech- nologie für moderne Software und intelligente Systeme. Diese Vorlesung gibt eine Einführung in das Maschinelle Lernen, wobei der Fokus auf dem überwachten Lernen für Klassiﬁkation und Regression liegt. Theoretische Grundlagen der Generalisierung werden ebenso behandelt wie praktische Aspekte und konkrete Lernalgorithmen.  Introduction  The Learning Problem  Training versus Testing  The Linear Model  Non-Linear Methods  Overﬁtting 5 Lernergebnisse und Kompetenzen: Die Studierenden verstehen die statistischen Grundlagen der Generalisierung, d.h. der Induktion von Modellen aus Daten, sowie praktischen Ansätzen zur Modellvalidierung. Sie können grund- legende Methoden und Algorithmen des überwachten Lernens auf Klassiﬁkations- und Regressi- onsprobleme anwenden. Nichtkognitive Kompetenzen  Lernkompetenz  Lernmotivation  Schreib- und Lesekompetenz (wissenschaftlich) 873   6  ,  Inhalte: Inhalte der Lehrveranstaltung Machine Learning II: Aufbauend auf einer grundlegenden Einführung in das maschinelle Lernen, wie beispielsweise vermittelt durch die Veranstaltung Machine Learning I, werden in dieser Vorlesung fortgeschrit- tene Themen in diesem Gebiet behandelt (reinforcement learning, online learning and bandit algorithms, multi-task learning, multi-target and structured output prediction, preference learning, learning from weak supervision, and uncertainty in machine learning). Obwohl die Vorlesung im Wesentlichen methodisch und algorithmisch ausgerichtet ist, werden auch theoretische und an- wendungsorientierte Aspekte behandelt.  From binary to multi-class classiﬁcation  Ordinal and hierarchical classiﬁcation  Ensemble methods  Nonlinear models and kernel machines  Multi-target prediction  Semi-supervised learning  Active learning  Online learning  Multi-armed bandits  Reinforcement learning  Preference learning and ranking 893   5 Lernergebnisse und Kompetenzen: Die Studierenden haben einen Überblick über Methoden zur Klassiﬁkation mit mehr als zwei Klassen, dem Lernen nichtlinearer Modelle, sowie Erweiterungen des einfachen Szenarios des überwachten Lernens. Sie verstehen algorithmische Konzepte entsprechender Lernverfahren und können diese Verfahren auf praktische Probleme anwenden. Nichtkognitive Kompetenzen  Lernkompetenz  Lernmotivation  Schreib- und Lesekompetenz (wissenschaftlich) 6  ,  Inhalte: Inhalte der Lehrveranstaltung Mobile Communication: Die Veranstaltung behandelt grundlegende Techniken für die Mobilkommunikation (z.B. drahtlose Kanalmodelle) und Techniken (z.B. Spreizbandkommunikation), wesentliche Protokollmechanis- men (z.B. Medienzugriff), Systeme der Mobilkommunikation sowie MobileIP . Neben technologi- schen und konzeptionellen Aspekten werden auch Verfahren und Methoden zur Leistungsbewer- tung besprochen.  Grundlagen: Kanalmodelle, Schwundkanal, Rayleigh-Kanal, Modulation, OFDM, Spreiz- bandverfahren  Medienzugriff: Aloha in Rayleigh-Kanal, CSMA, hidden Terminal, RTS/CTS, busy tone  Zellulare Systeme: GSM, UMTS, LTE, Fokus auf Systemarchitektur  Wireless LAN Systeme: IEEE 802.11, Medienzugriff, Leistungskontrolle, Leistungsanalyse nach Bianchi  Mobilität in Festnetzen: Mobile IP und verwandte Ansätze 5 Lernergebnisse und Kompetenzen: Teilnehmer kennen die Herausforderungen und Probleme beim Entwurf und Betrieb von Mobil- kommunikationssystemen. Sie können zwischen physikalischen und entwurfsbedingten Problem- stellungen differenzieren und geeignete Protokollmuster auswählen bzw. neue Protokolle konstru- ieren. Sie sind in der Lage, Mechanismen unterschiedlicher Architekturebenen auszuwählen, in eine sinnvolle Gesamtarchitektur zu integrieren und diese Auswahl zu begründen. Sie sind in der Lage, Protokollmechanismen quantitativ zu evaluieren (was auch fachübergreifend einsetzbar ist). Nichtkognitive Kompetenzen  Lernkompetenz  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Model-Based Systems Engineering: Ziel der Vorlesung ist ein umfassendes Verständnis des Model-Based Systems Engineerings (MB- SE) und seiner Bestandteile. Den Studierenden werden die wesentlichen Themengebiete des MBSE vermittelt. Hierzu gehören Grundlagen inkl. der Sprachen, Methoden und IT -Werkzeuge, die auch praktisch erprobt werden. Der Nutzen des MBSE (ein Systemverständnis bei allen betei- ligten Akteuren, eine Basis für die Kommunikation und Kooperation verschiedener Fachdisziplinen aber auch Funktionsbereiche, . . . ) wird den Studierenden vermittelt. Ferner werden wesentliche Analysemethoden für den Test von Systementwürfen behandelt. Im Fokus stehen multidiszipli- näre, software-intensive Systeme aus den Branchen Maschinen- und Anlagenbau sowie Automo- tive.  Grundlagen des MBSE  SysML für multidisziplinäre Systeme  CONSENS  weitere MBSE-Ansätze  Design Patterns  MBSE-Tools  Analysemethoden auf Basis des Systemmodells 5 Lernergebnisse und Kompetenzen: Lernergebnisse Die Studierenden sind in der Lage,  Modellbasiert zu arbeiten  Systemdenken anzuwenden  Systemarchitekturen zu erstellen & Anforderungen abzuleiten Nichtkognitive Kompetenzen  Selbststeuerungskompetenz  Schreib- und Lesekompetenz (wissenschaftlich)  Lernkompetenz  Lernmotivation 943   6  ,  Inhalte: Inhalte der Lehrveranstaltung Networked Embedded Systems: Ziel des Kurses ist es, vertiefte Einblicke in den Entwurf und die Programmierung eingebette- ter Systeme zu erlangen. Der Fokus liegt klar auf der Anwendungsdomäne Sensornetze. Daher werden fundamentale Grundlagen von Sensornetzen untersucht und im Rahmen der Übungen vertieft.  Entwurf, Architektur und Programmierung eingebetteter Systeme  Grundlagen und Anwendungen von Sensornetzen  Grundlagen drahtloser Kommunikation  Medienzugriff  Routing  Kooperation und Clustering 5 Lernergebnisse und Kompetenzen: Ziel ist es, grundlegende Konzepte vernetzter eingebetteter Systeme zu verstehen. Die Studie- renden sind in der Lage, diese Konzepte anzuwenden. Nichtkognitive Kompetenzen  Einsatz und Engagement  Lernkompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Optimierungsverfahren für das maschinelle Lernen: Maschinelle Lernverfahren kommen mittlerweile in zahllosen Anwendungen aus verschiedensten Disziplinen zum Einsatz. Der Kern des maschinellen Lernens ist die automatisierte Identiﬁkation und Ausnutzung von Mustern in Datensätzen. Im überwachten Lernen wird ein Verfahren anhand von Beispielen derart parametrisiert, dass es im Anschluss auf bisher unbekannten Daten ange- wendet werden kann (z. B. zur Identiﬁkation von Objekten in Bildern), dass es also generalisiert . Die Bestimmung dieser Parameter erfolgt im überwachten Lernen in aller Regel über das Lösen eines Optimierungsproblems : Bestimme die Parameter derart, dass der Fehler auf dem Trainings- datensatz minimal wird. Wie dieses Optimierungsproblem ausgestaltet ist, hängt maßgeblich vom zugrunde liegenden Lernverfahren sowie den Trainingsdaten ab. In dieser Veranstaltung werden die Grundlagen für das Training maschineller Lernverfahren aus- führlich behandelt. Die behandelten Themenblöcke sind:  Regressionsverfahren  Nichtlineare Optimierungsverfahren  Das Training tiefer neuronaler Netze  Stochastische Gradientenverfahren  Mehrzieloptimierungsansätze im maschinellen Lernen 5 Lernergebnisse und Kompetenzen: Studenten lernen  Faktenwissen über –die Grundlagen verschiedener mathematischer Optimierungsverfahren –die Besonderheiten über den Einsatz von Optimierungsmethoden für den Spezialfall des maschinellen Lernens –die notwendigen Teilschritte für das Training neuronaler Netze –die Grenzen des Trainings maschineller Lernverfahren  Methodisches Wissen über –die Konﬁguration und Implementierung sowie das Training neuronaler Netze –die Berücksichtigung großer Trainingsdatenmengen  Transfer-Wissen, u.a. die Fähigkeit –die Methoden auf neue Lernverfahren und Architekturen zu übertragen –ein auf die vorhandenen Daten geeignetes bzw. passendes Lernverfahren auszuwäh- len  Normatives Wissen, unter anderem die Fähigkeit folgendes zu bewerten: –die Eignung bestimmter Verfahren hinsichtlich der verfügbaren Datenmenge, der Sys- temkomplexität, etc. –die Grenzen bzw. Verlässlichkeit maschineller Lernverfahren Nichtkognitive Kompetenzen  Lernkompetenz  Lernmotivation 993   6  ,  Inhalte: Inhalte der Lehrveranstaltung Planning and Heuristic Search: Die Veranstaltung Planen und Heuristische Suche stellt zwei Ansätze zum Lösen wissensinten- siver Aufgaben vor. Im Bereich Planen werden Repräsentationen von Aufgabenstellungen als Planungsproblem in Zustandsräumen oder Planräumen vorgestellt und passende Verfahren dis- kutiert und analysiert. Im Bereich Heuristische Suche wird das Konzept des Zustandsraums ver- allgemeinert und ein Programmrahmen für systematische Suchverfahren beschrieben, der es erlaubt, die Suche durch Nutzung heuristischer Informationen über die Problemdomäne zu fo- kussieren. Als ein Anwendungsbeispiel werden Planungsverfahren als heuristische Suche imple- mentiert. In beiden Bereichen werden theoretische Ergebnisse vorgestellt und bewiesen. Bereich Planen  Einführung in Planungsprobleme  Repräsentation von Zustandsräumen und Planräumen  Algorithmen für das Planen  Komplexität von Planungsproblemen und Analyse von Planungsalgorithmen Bereich Heuristische Suche  Suchraumrepräsentationen  Informierte Suchverfahren  Relaxierte Modelle  Formale Eigenschaften informierter Suchverfahren 1013   5 Lernergebnisse und Kompetenzen: Die Studierenden sind in der Lage,  die Konzepte zur Modellierung von Planungs- und Suchaufgaben zu benennen und zu erklären,  die Vorgehensweisen von verschiedenen Planungsverfahren sowie von heuristischen Such- verfahren zu beschreiben,  einfache Aufgabenstellungen als Planungs- bzw. Suchaufgaben zu erkennen und zu reprä- sentieren,  darin Ansätze zur Erstellung brauchbarer Heuristiken zu entdecken,  theoretische Ergebnisse als Hinweise für die Auswahl von Modellierung und Verfahren zu verwenden. Nichtkognitive Kompetenzen  Lernkompetenz  Lernmotivation  Schreib- und Lesekompetenz (wissenschaftlich)  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Quantum Algorithms: Die Vorlesung stellt fortgeschrittene Methoden vor, um Quantenalgorithmen zu entwickeln. Inhalt:  Quantenschaltung  Quantenalgorithmen für algebraische Problemen  Quantum Walks  Quanten Query Komplexität  Adiabatische Quantencomputing 5 Lernergebnisse und Kompetenzen: Studierende können:  universelle Gatter beschreiben und benutzen,  die Quanten-Fourier-Transformation benutzen,  Quantum Walks benutzen,  adiabatische Quantenalgorithmen entwickeln,  mit Quanten-Query-Komplexität arbeiten Nichtkognitive Kompetenzen  Lernkompetenz  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Quantum Complexity Theory: Diese Vorlesung gibt einen kurzen Überblick über die Grundlagen von Quanteninformatik und wendet sich anschließend der Quantenkomplexitätstheorie zu. Dabei werden sowohl einführen- de als auch vertiefende Themen behandelt wie die Analoga zu P und NP (bezeichnet als BQP , QCMA, and QMA), Quanten-Erfüllbarkeitsprobleme, Quanten-interaktive Beweise und Tensor- Netzwerke. Begleitend wird semideﬁnite Programmierung als ein wichtiges Werkzeug eingeführt.  Komplexitätsklassen BQP , QCMA, QMA  Quanten-Erfüllbarkeitsprobleme  Quanten-interaktive Beweise  Tensor-Netzwerke  Semideﬁnite Programmierung 5 Lernergebnisse und Kompetenzen: Studierende können:  die Postulate von Quantenmechanik beschreiben und benutzen,  mit Komplexitätsklassen wie BQP und QMA arbeiten,  QMA-Schwere zeigen,  Semideﬁnite Programmierung nutzen,  Tensor-Netzwerke benutzen, um verschränkte Quantenzustände zu beschreiben Nichtkognitive Kompetenzen  Lernkompetenz  Selbststeuerungskompetenz 1063   6  ,  Inhalte: Inhalte der Lehrveranstaltung Real World Crypto Engineering: Starke Kryptographie ist nicht immer ausreichend, um die grundlegenden Sicherheitsziele zu schützen. Auch wenn starke kryptographische Algorithmen verwendet werden, kann bei deren Einsatz viel schief gehen. In dieser Vorlesung werden wir auf die wichtigsten Protokolle und kryp- tographische Schutzmechanismen eingehen (z.B. TLS, SSH, WPA) und werden ihre Basiskon- zepte kennenlernen. Anschließend werden wir prominente Angriffe vorstellen, die die gewünsch- ten Sicherheitsziele komplett gebrochen haben. Basierend auf vielen Fällen werden wir lernen, was beim Design und bei der Implementierung von kryptographischen Anwendungen wichtig ist. 5 Lernergebnisse und Kompetenzen: Studierende verfügen nach erfolgreichem Abschluss über ein umfassendes Verständnis der tech- nischen Aspekte von angewandten kryptographischen Algorithmen. Sie haben erkannt, dass Kryptographie alleine nicht ausreicht, um sicherheitstechnische Probleme zu lösen. Sie haben einen Überblick über aktuelle kryptographische Angriffe und wissen, wie man diese praktisch ver- hindert. Nichtkognitive Kompetenzen  Gruppenarbeit  Schreib- und Lesekompetenz (wissenschaftlich) 1083   6  ,  Inhalte: Inhalte der Lehrveranstaltung Reconﬁgurable Computing: Die Veranstaltung vermittelt Kenntnisse in Architekturen und Entwurfsmethoden für rekonﬁgurier- bare Hardware und stellt Anwendungen im Bereich des Hochleistungsrechnens und der einge- betteten Systeme vor.  Einführung: Evolution von programmierbaren Hardwarebausteinen, Marktentwicklung  Architekturen: FPGA Architekturen, rekonﬁgurierbare Bausteine und Systeme  Entwurfsmethoden: CAD für FPGAs, Hochsprachen und Compiler, Entwurf auf Systeme- bene  Anwendungen, insbesondere custom computing machines, eingebettete Systeme 5 Lernergebnisse und Kompetenzen: Die Studierenden sind nach dem Besuch der Lehrveranstaltung in der Lage,  den Aufbau rekonﬁgurierbarer Hardwarebausteine zu erklären,  die wesentliches Entwurfsmethoden zu benennen und zu analysieren und  die Eignung rekonﬁgurierbarer Hardware für verschiedene Einsatzgebiete zu beurteilen. Nichtkognitive Kompetenzen  Gruppenarbeit  Lernkompetenz 1103   6  ,  Inhalte: Inhalte der Lehrveranstaltung Routing and Data Management in Networks: Routing und Datenmanagement sind grundlegenden zu lösende Aufgaben, um eine efﬁziente Verwendung von großen Netzwerken wie z.B. dem Internet, Peer-to-Peer-Systemen, oder draht- losen mobilen Ad-hoc-Netzwerke zu ermöglichen. Diese Vorlesung befasst sich mit Algorithmen und deren Analyse für das Routing und Datenmanagement in solchen Systemen und beschreibt insbesondere Methoden für den Umgang mit ihrer Dynamik (Bewegung von Knoten, Beitritt und Austritt von Knoten). Dabei werden insbesondere lokale, verteilte Algorithmen, häuﬁg als online Algorithmen betrachtet.  Ofﬂine- und Online-Routing-Strategien  Scheduling-Strategien  Datenmanagement-Strategien 5 Lernergebnisse und Kompetenzen: Die Studierenden lernen die wichtigsten Techniken im Bereich des Routing und Datenmanage- ments von großen Netzwerken kennen. Sie können entscheiden, in welcher Situation welcher Datenmanagement-, Scheduling- oder Routing-Algorithmus geeignet ist. Sie können Algorithmen an neue Situationen anpassen. Nichtkognitive Kompetenzen  Haltung und Einstellung  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Software Quality Assurance: Das Ziel der Vorlesung ist die Behandlung von Ansätzen, Technologien und Strategien für die Qualitätssicherung von Softwaresystemen. Dies beinhaltet einerseits konstruktive Ansätze wie Design Pattern, Anti-Pattern, domänenspeziﬁsche Sprachen, modellgetriebene Softwareentwick- lung, Qualitätsmodelle und Architekturstile und andererseits analytische Ansätze wie statische Reviewtechniken und dynamisch Testtechniken. Des Weiteren werden Ansätze für die Verbes- serung des Softwareentwicklungsprozesses und internationale Standards wie ISO 9001, 9126, CMM, usw. behandelt.  Einführung in die Softwarequalitätssicherung  Standards –Produktspeziﬁsche Standards: ISO 9126 –Prozessspeziﬁsche Standards: ISO 9001, CMM  Konstruktive Ansätze –Pattern und Stile: Design Pattern, Anti-Pattern, Architekturstile –Modellgetriebene Softwareentwicklung –Metamodellierung –Domänenspeziﬁsche Sprachen –Design By Contract –Forschung: Process Constraints  Analytische Ansätze –Reviews, Inspektionen –Testen: Fundamentaler Testprozess, Black Box Testen, White Box Testen 5 Lernergebnisse und Kompetenzen: Die Studierenden sind in der Lage, Qualitätseigenschaften von Entwicklungsprozessen, Softwa- remodellen bzw. -systemen zu benennen. Sie kennen Techniken zur konstruktiven bzw. ana- lytischen Sicherstellung von Qualitätseigenschaften und können diese geeignet einsetzen. Sie kennen die wesentlichen Standards für die Bewertung von Prozess- und Produktqualitäten. Sie können ausgewählte, aktuelle Forschungsansätze im Bereich Prozess- und Softwarequalitätssi- cherung verstehen und einordnen. Nichtkognitive Kompetenzen  Empathie  Lernkompetenz  Lernmotivation  Motivationale und volitionale Fähigkeiten 1153   6  ,  Inhalte: Inhalte der Lehrveranstaltung Statistical Natural Language Processing: Diese Vorlesung vermittelt Methoden und Verfahren zur Konzeption und Implementierung von Sprachverarbeitungspipelines. Zu den Kerninhalten gehören Textvorverarbeitung, Parsing, distri- butionale Semantik, dedizierte maschinelle Lernverfahren und Anwendungen wie Fragebeantwor- tungssysteme.  Normalisierung  Sprachmodelle  Spelling correction  Maschinelles Lernen  POS Tagging  Parsing  Distributionale Semantik  Wortbedeutung  Wissensextraktion  Fragebeantwortungssysteme 1173   5 Lernergebnisse und Kompetenzen: Studierende sind in der Lage, relevante Probleme und Lösungsanforderungen für folgende Bei- spielgebiete zu benennen:  Vorverarbeitung von Korpora  Sprachmodelle  Rechtschreibprüfung  Text und Dokumentenklassiﬁkation  Distributionale Semantik  Fragebeantwortungssysteme Sie sind mit grundlegenden Techniken vertraut, können Einschränkungen dieser Techniken in konkreten Problemfällen herausﬁnden (wissenschaftliche Methodik anwenden), und veränderte oder angepasste Techniken entwickeln, um solche Probleme zu umgehen. Sie können solche Veränderungen qualitativ und quantitativ evaluieren. Nichtkognitive Kompetenzen  Gruppenarbeit  Lernkompetenz  Medienkompetenz  Schreib- und Lesekompetenz (wissenschaftlich) 6  ,  Inhalte: Inhalte der Lehrveranstaltung Statistical Signal Processing: Unter “Statistical signal processing” versteht man die Techniken, die Ingenieure und Statistiker be- nutzen, um unvollständige und fehlerbehaftete Messungen auszuwerten. Diese Veranstaltung be- schäftigt sich mit einer Auswahl von Themen aus den wesentlichen Bereichen Detektion, Schätz- theorie und Zeitreihenanalyse. Mögliche Themen dieser Veranstaltung sind Korrelationsanalyse, LMMSE Schätzer, Güteab- schätzungen von Parameterschätzfunktionen, Neyman-Pearson Detektoren, im weiteren Sinne stationäre Zeitreihen, nichtstationäre Zeitreihen, periodisch stationäre Zeitreihen und komplex- wertige Zufallssignale. 5 Lernergebnisse und Kompetenzen: Nach dem Besuch dieser Veranstaltung werden Studenten mit den Grundprinzipien der statisti- schen Signalverarbeitung vertraut sein. Sie verstehen, wie man Techniken der statistischen Si- gnalverarbeitung in der Elektrotechnik einsetzen kann und sie können diese auf relevante Gebie- te (wie z.B. in der Nachrichtentechnik) anwenden. Studenten werden das Vertrauen entwickeln, mathematische Probleme in Analyse und Design lösen zu können. Die in dieser Veranstaltung gelernten Prinzipien können auf andere Gebiete angewandt werden. Nichtkognitive Kompetenzen  Einsatz und Engagement  Kooperationskompetenz  Lernkompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Strategische Produktplanung im Zeitalter der Digitalisierung: Im Zeitalter der Digitalisierung eröffnen sich mehr denn je faszinierende Möglichkeiten für neue Produkte und Dienstleistungen. Die Frage ist nur, ob diese Neuheiten im Markt erfolgreich sein werden. Ziel der Vorlesung ist ein umfassender Überblick über Methoden und Werkzeuge der strategischen Planung im Zeitalter der Digitalisierung. Den Studierenden werden die wesentlichen Themengebiete der strategischen Planung vermittelt. Hierzu gehören Grundlagen, Methoden und IT -Werkzeuge. Die Erkenntnisse aus der Vorlesung werden im Rahmen einer begleitenden Übung und Case Study näher erläutert und vertieft. Im Fokus der Vorlesung stehen intelligente techni- sche Systeme mit einem hohen Software-Anteil. 5 Lernergebnisse und Kompetenzen: Ziel ist es, grundlegende Konzepte der strategischen Planung zu verstehen und ausgewählte Methoden anwenden zu können. Dabei werden insbesondere die Potentialﬁndung, die Produkt- ﬁndung und die Geschäftsplanung vertieft. Nichtkognitive Kompetenzen  Gruppenarbeit  Kooperationskompetenz  Motivationale und volitionale Fähigkeiten  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung Topics in Pattern Recognition and Machine Learning: In der Veranstaltung “Aktuelle Themen aus Mustererkennung und maschinellem Lernen” werden zunächst die Grundkonzepte der Mustererkennung und des maschinellen Lernens kurz zusam- mengefasst. Anschließend werden ausgewählte Themen behandelt. Die Auswahl orientiert sich dabei an aktuellen Forschungsthemen und variiert von Jahr zu Jahr. Beispiele für solche Themen sind:  Schätzung von Modellen mit verborgenen Variablen, um eine in den Daten vermutete zu- grundeliegende innere Struktur zu entdecken  Spezielle Klassiﬁkationsaufgaben (z.B. automatische Spracherkennung)  Grundlagen der statistischen Mustererkennung: Bayes’sche Regel, Lernen von Verteilungs- dichten, lineare Modelle für Klassiﬁkation und Regression, Kernelmethoden  EM-Algorithmus für Maximum-Likelilhood und Bayes’sche Schätzung  Modelle mit diskreten und kontinuierlichen verborgenen Variablen: GMM, NMF  Bias-Varianz Dilemma und Abtausch von Detailgenauigkeit der Modelle und Generalisie- rungsfähigkeit  Graﬁsche Modelle  Sequentielle Daten und Hidden Markov Modelle mit Anwendungen in der Spracherkennung  Aktuelle Veröffentlichungen aus Mustererkennung und maschinellem Lernen Während der erste Teil der Veranstaltung aus dem üblichen Vorlesungs-/Übungsschema besteht, werden die Studenten im zweiten Teil aktuelle Veröffentlichungen lesen, analysieren und präsen- tieren. Dies kann häuﬁg auch die Realisierung von Algorithmus in Matlab umfassen. 5 Lernergebnisse und Kompetenzen: Die Studierenden sind nach Absolvieren des Moduls in der Lage,  Für ein vorgegebenes Mustererkennungsproblem einen geeigneten Klassiﬁkator auszu- wählen und zu trainieren  Für ein gegebenes Regressionsproblem einen geeigneten Ansatz auswählen und die Pa- rameter auf Trainingsdaten zu erlernen  Nach in Daten verborgener Struktur mit Methoden des maschinellen Lernens zu suchen  Eine geeignete Wahl für ein Modell treffen, welches einen guten Kompromiss zwischen Detailgrad und Verallgemeinerungsfähigkeit darstellt  Aktuelle Veröffentlichungen aus dem Bereich der Mustererkennung und des maschinellen Lernens zu verstehen, zu analysieren und zu bewerten Nichtkognitive Kompetenzen  Einsatz und Engagement  Kooperationskompetenz  Lernkompetenz  Schreib- und Lesekompetenz (wissenschaftlich) 1243   6  ,  Inhalte: Inhalte der Lehrveranstaltung Topics in Signal Processing: Auswahl von aktuellen Themen in der Signalverarbeitung. Ein Teil der Veranstaltung besteht aus regulären Vorlesungen, wohingegen der andere die Mitarbeit von Studierenden voraussetzt. Zunächst werden in diesem Kurs relevante Aspekte aus der linearen Algebra und Wahrscheinlich- keitstheorie wiederholt. Danach werden die Studierenden angeleitet, aktuelle Veröffentlichungen aus der Signalverarbeitungsliteratur zu lesen, zu analysieren und dann auch zu präsentieren. 5 Lernergebnisse und Kompetenzen: In diesem Modul werden die Studierenden mit aktuellen Forschungsthemen in der Signalverarbei- tung vertraut gemacht. Sie lernen, wissenschaftliche Veröffentlichungen zu verstehen und kritisch zu bewerten. Nichtkognitive Kompetenzen  Einsatz und Engagement  Kooperationskompetenz  Lernkompetenz  Schreib- und Lesekompetenz (wissenschaftlich) 1263   6  ,  Inhalte: Inhalte der Lehrveranstaltung Usable Security and Privacy: Die Studierenden erwerben praktisches, forschungsorientiertes Wissen über nutzbare Sicherheit und Privatsphäre: 1) von der technischen Seite, indem sie eine Anwendung für nutzbare Sicher- heit programmieren, oder 2) von der Seite der menschlichen Verhaltensforschung, indem sie eine Nutzerstudie entwerfen und vorab testen. 5 Lernergebnisse und Kompetenzen: Teilnehmer der Veranstaltung  entwickeln ein Verständnis für die Bedeutung der Sicherheit und des Schutzes der Privat- sphäre  lernen die Geschichte des Fachgebiets und die wichtigsten Forschungsbereiche und Her- ausforderungen kennen  sind in der Lage, Methoden zur Durchführung von Nutzerforschung im Bereich Sicherheit und Datenschutz anzuwenden Nichtkognitive Kompetenzen  Gruppenarbeit  Schreib- und Lesekompetenz (wissenschaftlich)  Selbststeuerungskompetenz 6  ,  Inhalte: Inhalte der Lehrveranstaltung VLSI Testing: Die Lehrveranstaltung behandelt systematische Verfahren zur Erkennung von Hardware-Defekten in mikroelektronischen Schaltungen. Es werden sowohl Algorithmen zur Erzeugung und Auswer- tung von Testdaten als auch Hardwarestrukturen zur Verbesserung der Testbarkeit und für den eingebauten Selbsttest vorgestellt. Im einzelnen werden die folgenden Themen behandelt:  Fehlermodelle  Testbarkeitsmaße und Maßnahmen zur Verbesserung der Testbarkeit  Logik- und Fehlersimulation  Algorithmen zur Testmustererzeugung  Selbsttest, insbesondere Testdatenkompression und Testantwortkompaktierung  Speichertest 5 Lernergebnisse und Kompetenzen: Die Studierenden sind nach Absolvieren des Moduls in der Lage,  Fehlermodelle, Maßnahmen zur Verbesserung der Testbarkeit und Werkzeuge zur Unter- stützung des Tests zu beschreiben,  die grundlegenden Modelle und Algorithmen für Fehlersimulation und Test zu erklären und anzuwenden, sowie  Systeme im Hinblick auf ihre Testbarkeit zu analysieren und geeignete Teststrategien aus- zuwählen. Nichtkognitive Kompetenzen  Einsatz und Engagement  Kooperationskompetenz  Lernkompetenz 1303   6  ,  Inhalte: Inhalte der Lehrveranstaltung Web Security: Moderne Webapplikationen und Webservices sind oft vielschichtig und basieren auf unterschied- lichen (oft komplexen) Technologien, die ständig weiterentwickelt werden. Deren Komplexität ist oft der Grund für neuartige Angriffe, die im Web-Bereich täglich zu sehen sind. In dieser Vorlesung werden wir auf die wichtigsten Technologien eingehen und lernen, worauf man bei der sicheren Web-Entwicklung achten muss. Dabei werden wir prominente und weit verbreitete Angriffe vorstellen und zeigen, wie man die verhindert. Dazu gehören typische Angriffe aus der OWASP Top 10 Liste wie XSS oder SQL Injection bis hin zu Angriffen auf Webservices und Single Sign-On Standards (wie SAML und OpenID Connect). Basierend auf vielen Fällen werden wir lernen, was beim Design und bei der Implementierung von Webapplikationen wichtig ist. 5 Lernergebnisse und Kompetenzen: Studierende verfügen nach erfolgreichem Abschluss über ein umfassendes Verständnis der tech- nischen Aspekte von Webapplikationen, Webservices und diversen Authentizierungsmechanis- men. Sie haben erkannt, dass die heutzutage eingesetzten Web-Technologien vielschichtig sind und dass deren Komplexität viele Sicherheitsprobleme mit sich bringt. Studierende haben einen Überblick über aktuelle Web-Angriffe und wissen wie man diese praktisch verhindert. Nichtkognitive Kompetenzen  Gruppenarbeit  Schreib- und Lesekompetenz (wissenschaftlich)"   
  }
]